{
    "2019": [
        "Pacha, Alexander, and Jorge Calvo-Zaragoza. 2019. “Learning Notation Graph Construction for Full-Pipeline Optical Music Recognition.” In <i>Proceedings of the 20th International Society for Music Information Retrieval Conference (ISMIR)</i>, 8. at Delft, the Netherlands. <a href=\"https://archives.ismir.net/ismir2019/paper/000006.pdf\">https://archives.ismir.net/ismir2019/paper/000006.pdf</a>."
    ],
    "2017": [
        "Greet, Justin. 2017. “Improved Optical Music Recognition (OMR).” <a href=\"http://cs231n.stanford.edu/reports/2017/pdfs/20.pdf\">http://cs231n.stanford.edu/reports/2017/pdfs/20.pdf</a>."
    ],
    "2015": [
        "Shi, Baoguang, Xiang Bai, and CongYao. 2015. <i>An end-to-end trainable neural network for image-based sequence recognition and Its application to scene text recognition</i>. arXiv preprint.",
        "Wen, Cuihong, Ana Rebelo, Jing Zhang, and Jaime Cardoso. 2015. “A New Optical Music Recognition System Based on Combined Neural Network.” <i>Pattern Recognition Letters</i> 58:1–7."
    ],
    "2014": [
        "Montagner, Igor, Roberto Hirata Jr., and Nina Hirata. 2014. “Learning to Remove Staff Lines from Music Score Images.” In <i>Proceedings of the IEEE International Conference on Image Processing</i>, 2614–18. <a href=\"https://doi.org/DOI:http://dx.doi.org/10.1109/ICIP.2014.7025529\">https://doi.org/DOI:http://dx.doi.org/10.1109/ICIP.2014.7025529</a>."
    ],
    "2013": [
        "Steyn, Jacques, ed. 2013. <i>Structuring Music through Markup Language: Designs and Architectures</i>. IGI Global. <a href=\"https://doi.org/10.4018/978-1-4666-2497-9\">https://doi.org/10.4018/978-1-4666-2497-9</a>.",
        "Visaniy, Muriel, Van Cuong Kieu, Alicia Fornés, and Nicholas Journet. 2013. “ICDAR 2013 Music Scores Competition: Staff Removal.” In <i>Proceedings of the International Conference on Document Analysis and Recognition</i>, 1407–11."
    ],
    "2012": [
        "Rebelo, Ana, Ichiro Fujinaga, Filipe Paszkiewicz, Carlos Guedes, Andre Marcal, and Jaime Cardoso. 2012. “Optical Music Recognition: State of the Art and Open Issues for Handwritten Music Scores.” <i>International Journal of Multimedia Information Retrieval</i> 1 (3):173–90."
    ],
    "2011": [
        "Helsen, Kate. 2011. “‘Venite et Videte’: First Results in the Optical Neume Recognition Project.” In <i>Cantus Planus Conference</i>. Vienna.",
        "Pinto, Telmo, Ana Rebelo, Gilson Giralid, and Jaime Cardoso. 2011. “Music Score Binarization Based on Domain Knowledge.” In <i>Pattern Recognition and Image Analysis</i>, edited by Jordi Vitrià, João Miguel Sanches, and Mario Hernández, 700–708. Berlin: Springer.",
        "Rajds, Arkadiusz. 2011. “Mathematical Morphology in the Process of Musical Notation Recognition.” In <i>Advances in Intelligent and Soft Computing</i>, 84:331–35. 2010.",
        "Tambouratzis, Tatiana. 2011. “Identification of Key Music Symbols for Optical Music Recognition and On-Screen Presentation.” In <i>The 2011 International Joint Conference on Neural Networks (IJCNN)</i>, 1935–42."
    ],
    "2010": [
        "Cardoso, Jaime, and Ana Rebelo. 2010. “Robust Staffline Thickness and Distance Estimation in Binary and Gray-Level Music Scores.” In <i>Proceedings of the 20th International Conference on Pattern Recognition</i>, 1856–59.",
        "Cui, Jiali, He Huan, and Yiding Wang. 2010. “An Adaptive Staff Line Removal in Music Score Images.” In <i>10th Annual Conference on Signal Processing (ICSP)</i>, 964–67.",
        "Dutta, Anjan, Umapada Pal, Alicia Fornés, and Josep Lladós. 2010. “An Efficient Staff Removal Approach from Printed Musical Documents.” In <i>Proceedings of International Workshop on Structural and Syntactic Pattern Recognition</i>, 373–82.",
        "Gordo, Albert, Alicia Fornés, Ernest Valveny, and Josep Lladós. 2010. “A Bag of Notes Approach to Writer Identification in Old Handwritten Musical Scores.” In <i>Proceedings of the 9th IAPR International Workshop on Document Analysis Systems</i>, 247–54.",
        "Gozzi, Gianmarco. 2010. <i>OMRJX: A framework for piano scores optical music recognition</i>. Politecnico di Milano.",
        "Hankinson, Andrew, Laurent Pugin, and Ichiro Fujinaga. 2010. “An Interchange Format for Optical Music Recognition Applications.” In <i>Proceedings of the 11th Annual Conference of the International Society for Music Information Retrieval (ISMIR)</i>, 51–56. at Utrecht, Netherlands.",
        "Ramirez, Carolina, and Jun Ohya. 2010. “Symbol Classification Approach for OMR of Square Notation Manuscripts.” In <i>Proceedings of the 11th Annual Conference of the International Society for Music Information Retrieval (ISMIR)</i>, 549–53. at Utrecht, Netherlands.",
        "Rebelo, Ana, G. Capela, and Jaime Cardoso. 2010. “Optical Recognition of Music Symbols: A Comparative Study.” <i>International Journal on Document Analysis and Recognition</i> 13 (1):19–31.",
        "Sammartino, Simone, Lorenzo Tardón, and Isabel Barbancho. 2010. “Graphical Tool for the Optical Music Recognition of Scores in White Mensural Notation.” In <i>Proceedings of the Conference on Artificial Intelligence and Applications</i>. at Innsbruck Austria.",
        "Tardón, Lorenzo, Simone Sammartino, Isabel Barbancho, Véronica Gómez, and Antonio Oliver. 2010. “Optical Music Recognition for Scores Written in White Mensural Notation.” In <i>EURASIP Journal on Image and Video Processing</i>, 2009."
    ],
    "2009": [
        "Burgoyne, John, Yue Ouyang, Tristan Himmelman, Johanna Devaney, Laurent Pugin, and Ichiro Fujinaga. 2009. “Lyric Extraction and Recognition on Digital Images of Early Music Sources.” In <i>Proceedings of the 10th International Society for Music Information Retrieval (ISMIR)</i>, 723–27. at Kobe, Japan.",
        "Byrd, Donald, William Guerin, Megan Schindele, and Ian Knopke. 2009. <i>OMR Evaluation and Prospects for Improved OMR via Multiple Recognizers</i>.",
        "Dalitz, Christoph, and Bastian Pranzas. 2009. “German Lute Tablature Recognition.” In <i>Proceedings of the 10th International Conference on Document Analysis and Recognition</i>, 371–75. at Barcelona, Spain.",
        "Fornés, Alicia, Josep Lladós, Sánchez Gemma, and Bunke Horst. 2009. “On the Use of Textural Features for Writer Identification in Old Handwritten Music Scores.” In <i>Proceedings of the 10th International Conference on Document Analysis and Recognition</i>, 996–1000. at Barcelona, Spain.",
        "Genfang, Chen, Zhang Wenjun, and Wang Qiuqiu. 2009. “Pick-up the Musical Information from Digital Musical Score Based on Mathematical Morphology and Music Notation.” In <i>Proceedings of the First International Workshop on Education Technology and Computer Science</i>, 1141–44. at Wuhan, Hubei.",
        "Johansen, Linn. 2009. <i>Optical Music Recognition</i>. University of Oslo.",
        "Liu, Xiaoxiang, and Shu-Sheng Zhang. 2009. “Structure Analysis Approach of Music Notes for Optical Music Recognition.” <i>Computer Engineering and Design</i> 30 (3):709–12.",
        "Nielsen, Johan. 2009. <i>Statistical Analysis of Music Corpora</i>. University of Copenhagen.",
        "Ouyang, Yue, John Burgoyne, Laurent Pugin, and Ichiro Fujinaga. 2009. “Complex Layout Analysis of Medieval Music Manuscripts for Information Extraction and Optical Reccognition.” In <i>Proceedings of the International Computer Music Conference</i>. at Montreal, QC.",
        "Phon-Amnuaisuk, Somnuk. 2009. “Estimating HMM Parameters Using Particle Swarm Optimisation.” In <i>Applications of Evolutionary Computing</i>. Berlin: Springer.",
        "Pugin, Laurent and Forthcoming. 2009. “Editing Renaissance Music: The Aruspix Project.” In <i>Internationales Jahrbuch Für Editionswissenschaften</i>, Beihefte zur Editio, 94–103.",
        "Santos, Cardoso dos, Arthur Capela Jaime, Ana Rebelo, Carlos Guedes, and Joaquim da Costa. 2009. “Staff Detection with Stable Paths.” <i>IEEE Transactions on Pattern Analysis and Machine Intelligence</i> 31 (6):1134–39.",
        "Vrist, Søren. 2009. <i>Optical Music Recognition for Structural Information from High-Quality Scanned Music</i>. University of Copenhagen."
    ],
    "2008": [
        "Bellini, Pierfrancesco, Ivan Bruno, and Paolo Nesi. 2008. “Optical Music Recognition: Architecture and Algorithms.” In <i>Interactive Multimedia Music Technologies</i>, edited by Kia Ng and and Paolo Nesi. Hershey, PA: Information Science Reference.",
        "Bullen, Andrew. 2008. <i>Bringing Sheet Music to Life: My Experiences with OMR</i>.",
        "Burgoyne, John, Johanna Devaney, Laurent Pugin, and Ichiro Fujinaga. 2008. “Enhanced Bleedthrough Correction for Early Music Documents with Recto-Verso Registration.” In <i>Proceedings of the Conference of the International Society for Music Information Retrieval (ISMIR)</i>, 407–12. at Philadelphia, PA.",
        "Cardoso, Jaime, Aarthur Capela, Ana Rebelo, Carlos Guedes, and and INESC Porto. 2008. “A Connected Path Approach for Staff Detection on a Music Score.” In <i>Proceedings of the 15th IEEE International Conference on Image Processing</i>, 1005–8.",
        "Castro, Pedro, Rui Almeida, and João Caldas Pinto. 2008. “Restoration of Double-Sided Ancient Music Documents with Bleed-Through.” In <i>Progress in Pattern Recognition, Image Analysis and Applications</i>. Berlin: Springer.",
        "Dalitz, Christoph, Georgios Michalakis, and Christine Pranzas. 2008. “Optical Recognition of Psaltic Byzantine Chant Notation.” <i>International Journal on Document Analysis and Recognition</i> 11 (3):143–58.",
        "Dalitz, Christoph, Michael Droettboom, Bastian Pranzas, and Ichiro Fujinaga. 2008. “A comparative study of staff removal algorithms.” <i>IEEE transactions on pattern analysis and machine intelligence</i> 30 (5):753–66.",
        "Fornés, Alicia, Josep Lladós, and Gemma Sánchez. 2008. “Old Handwritten Musical Symbol Classification by a Dynamic Time Warping Based Method.” In <i>Graphics Recognition. Recent Advances and New Opportunities</i>, edited by Wenyin Liu, Josep Lladós, and Jean-Marc Ogier, 51–60. Berlin: Springer.",
        "Fremerey, Christian, Meinard Müller, Frank Kurth, and Michael Clausen. 2008. “Automatic Mapping of Scanned Sheet Music to Audio Recordings.” In <i>Proceedings of the Ninth Conference of the International Society for Music Information Retrieval (ISMIR)</i>, 413–18. at Philadelphia, PA.",
        "Jones, Graham, Bee Ong, Ivan Bruno, and Kia Ng. 2008. “Optical Music Imaging: Music Document Digitisation, Recognition, Evaluation and Restoration.” In <i>Interactive Multimedia Music Technologies</i>, edited by Kia Ng and Paolo Nesi, 50–79. Hershey, PA: Information Science Reference.",
        "Kolakowska, Agata. 2008. “Applying Decision Trees to the Recognition of Musical Symbols.” In <i>Proceedings of the First International Conference on Information Technology</i>. at Gdansk, Poland.",
        "Laskov, Lasko, and Dimo Dimov. 2008. “Segmentation of Ancient Neumatic Musical Notation.” In <i>Proceedings of the International Conference on Automatics and Informatics</i>, 21–24. at Sofia, Bulgaria.",
        "Pugin, Laurent, Jason Hockman, John Burgoyne, and Ichiro Fujinaga. 2008. “Gamera versus Aruspix: Two Optical Music Recognition Approaches.” In <i>Proceedings of the Ninth Conference of the International Society for Music Information Retrieval (ISMIR)</i>, 419–24. at Philadelphia, PA.",
        "Pugin, Laurent. 2008. “Computer Tools for Early Music Sources Comparison: A Practical Study on Marenzio Editions and Re-Editions.” <i>Music, Poetry, Patronage, and Reception in Late Renaissance: Luca Marenzio and the Madrigal</i>.",
        "Smiatacz, Maciej, and Witold Malina. 2008. “Matrix-Based Classifiers Applied to Recognition of Musical Notation Symbols.” In <i>Proceedings of the First International Conference on Information Technology</i>, 1–4. at Gdansk Poland.",
        "Szwoch, Mariusz. 2008. “Using MusicXML to Evaluate Accuracy of OMR Systems.” In <i>Proceedings of the Fifth International Conference on Diagrammatic Representation and Inference</i>, 419–22. at Herrsching Germany.",
        "Wei, Lee Ling, Qussay Salih, and Ho Sooi Hock. 2008. “Optical Tablature Recognition (OT) System: Using Fourier Descriptors as a Recognition Tool.” In <i>Proceedings of the International Conference on Audio, Language and Image Processing</i>, 1532–39. at Shanghai, China."
    ],
    "2007": [
        "Bellini, Pierfrancesco, Ivan Bruno, and Paolo Nesi. 2007. “Assessing Optical Music Recognition Tools.” <i>Computer Music Journal</i> 31 (1):68–93.",
        "Burgoyne, John, Laurent Pugin, Gred Eustace, and Ichiro Fujinaga. 2007. “A Comparative Survey of Image Binarisation Algorithms for Optical Recognition on Degraded Musical Sources.” In <i>Proceedings of the Eighth International Conference on Music Information Retrieval (ISMIR)</i>, 509–12. at Vienna, Austria.",
        "Castro, Pedro, and João Caldas Pinto. 2007. <i>Methods for written ancient music restoration, Image analysis and recognition</i>. Berlin: Springer.",
        "Knopke, Ian, and Donald Byrd. 2007. “Towards MusicDiff: A Foundation for Improved Optical Music Recognition Using Multiple Recognizers.” In <i>Proceedings of the Eighth Annual Conference of the International Society for Music Information Retrieval (ISMIR)</i>, 121–24. at Vienna, Austria.",
        "Kurth, Frank, Meinard Müller, Christian Fremerey, Yoon-Ha Chang, and Michael Clausen. 2007. “Automated Synchronization of Scanned Sheet Music with Audio Recordings.” In <i>Proceedings of the Seventh International Conference on Music Information Retrieval (ISMIR)</i>, 261–66. at Vienna, Austria.",
        "Laskov, Lasko, and Dimo Dimov. 2007. “Color Image Segmentation for Neume Note Recognition.” In <i>Proceedings of the International Conference on Automatics and Informatics</i>, 37–41. at Sofia, Bulgaria.",
        "McKay, Cory, and Ichiro Fujinaga. 2007. “Style-Independent Computer-Assisted Exploratory Analysis of Large Music Collections.” <i>Journal of Interdisciplinary Music Studies</i> 1 (1):63–85.",
        "Miyao, Hidetoshi, and Masayuki Okamoto. 2007. “Stave Extraction for Printed Music Scores Using Dp Matching.” <i>Journal of Advanced Computational Intelligence and Intelligent Informatics</i> 8 (2):208–15.",
        "Pugin, Laurent, John Burgoyne, Douglas Eck, and Ichiro Fujinaga. 2007. “Book-Adaptive and Book-Dependent Models to Accelerate Digitization of Early Music.” In <i>NIPS Workshop on Music, Brain, and Cognition</i>. at Whistler, BC.",
        "Pugin, Laurent, John Burgoyne, and Ichiro Fujinaga. 2007a. “Goal-Directed Evaluation for the Improvement of Optical Music Recognition on Early Music Prints.” In <i>Proceedings of the Seventh ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL)</i>, 303–4. at Vancouver, BC.",
        "Pugin, Laurent, John Burgoyne, and Ichiro Fujinaga. 2007b. “MAP Adaptation to Improve Optical Music Recognition of Early Music Documents Using Hidden Markov Models.” In <i>Proceedings of the Eighth International Conference on Music Information Retrieval (ISMIR)</i>, 513–16. at Vienna, Austria.",
        "Pugin, Laurent, John Burgoyne, and Ichiro Fujinaga. 2007c. “Reducing Costs for Digitising Early Music with Dynamic Adaptation.” In <i>Research and Advanced Technology for Digital Libraries</i>, edited by László Kovács, Norbert Fuhr, and Carlo Meghini, 4675:471–74. Berlin: Springer.",
        "Rebelo, Ana, Arthur Capela, Joaquim da Costa, Carlos Guedes, Eeurico Carrapatoso, and Jaime Cardoso. 2007. “A Shortest Path Approach for Staff Line Detection.” In <i>Proceedings of the Third International Conference on Automated Production of Cross Media Content for Multi-Channel Distribution (AXMEDIS)</i>, 33–44.",
        "Rossant, Florence, and Isabelle Bloch. 2007. “Robust and Adaptive OMR System Including Fuzzy Modeling, Fusion of Musical Rules, and Possible Error Detection.” In <i>EURASIP Journal on Advances in Signal Processing 2007</i>, 1:160–85."
    ],
    "2006": [
        "Bainbridge, David, and Tim Bell. 2006. “Identifying Music Documents in a Collection of Images.” In <i>Proceedings of the Seventh International Conference on Music Information Retrieval (ISMIR)</i>. Victoria, BC.",
        "Byrd, Donald, and Megan Schindele. 2006. “Prospects for Improving OMR with Multiple Recognizers.” In <i>Seventh International Conference on Music Information Retrieval (ISMIR)</i>, 41–46.",
        "Choudhury, G.Sayeed, Tim DiLauro, Robert Ferguson, Michael Droettboom, and Ichiro Fujinaga. 2006. <i>Document recognition for a million books</i>. Vol. 12. 3. D-Lib Magazine.",
        "Fornés, Alicia, Josep Lladós, and Sánchez Gemma. 2006. “Primitive Segmentation in Old Handwritten Music Scores.” In <i>Graphics Recognition. Ten Years Review and Future Perspectives</i>, edited by Liu Wenyin and Josep Lladós. Berlin: Springer.",
        "Homenda, Wladyslaw, and Marcin Luckner. 2006a. “Automatic Knowledge Acquisition: Recognizing Music Notation with Methods of Centroids and Classifications Trees.” In <i>Proceedings of the International Conference on Neural Networks</i>, 3382–88. at Vancouver, BC.",
        "Homenda, Wladyslaw, and Marcin Luckner. 2006b. “Braille Score.” In <i>Proceedings of the International Conference on Intelligent Systems Design and Applications</i>, 775–80. at Jinan, China.",
        "Homenda, Wladyslaw. 2006. “Automatic Understanding of Images: Integrated Syntactic and Semantic Analysis of Music Notation.” In <i>Proceedings of the International Conference on Neural Networks</i>, 3026–33. at Vancouver, BC.",
        "Laskov, Lasko. 2006. “Classification and Recognition of Neume Note Notation in Historical Documents.” In <i>Proceedings of the International Conference on Computer Systems and Technologies</i>. at Veliko Tarnovo, Bulgaria.",
        "Luckner, Marcin. 2006. “Recognition of Noised Patterns Using Non-Disruption Learning Set.” In <i>Proceedings of the Sixth International Conference on Intelligent Systems Design and Applications</i>, 557–62. at Jinan.",
        "McKay, Cory, and Ichiro Fujinaga. 2006. “Jsymbolic: A Feature Extractor for Midi Files.” In <i>Proceedings of the International Computer Music Conference</i>. at New Orleans, LA.",
        "Pugin, Laurent. 2006a. “Aruspix: An automatic source-comparison system.” <i>Computing in Musicology</i> 14:49–60.",
        "Pugin, Laurent. 2006b. “Optical Music Recognition of Early Typographic Prints Using Hidden Markov Models.” In <i>Proceedings of the Seventh International Conference for Music Information Retrieval (ISMIR)</i>, 53–56. at Victoria, BC.",
        "Pugin, Laurent. 2006c. “Representation and Dissemination of Music: Early Typographic Prints and Digitalization.” In <i>Contemporary Classical Music: Papers of the 2006 Intercongressional Symposium of the International Musicological Society</i>.",
        "Toyama, Fubito, Kenji Shoji, and Juichi Miyamichi. 2006. “Symbol Recognition of Printed Piano Scores with Touching Symbols.” In <i>Proceedings of the 18th International Conference on Pattern Recognition</i>, 480–83. at Hong Kong."
    ],
    "2005": [
        "Barton, Lewis, John Caldwell, and Peter Jeavons. 2005. “E-Library of Medieval Chant Manuscript Transcriptions.” In <i>Proceedings of the 5th ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL)</i>, 320–29. Denver, CO.",
        "Dalitz, Christoph, and Thomas Karsten. 2005. “Using the Gamera Framework for Building a Lute Tablature Recognition System.” In <i>Proceedings of the Sixth International Conference on Music Information Retrieval (ISMIR)</i>, 478–81. at London, UK.",
        "Homenda, Wladyslaw. 2005. “Optical Music Recognition: The Case Study of Pattern Recognition.” In <i>Computer Recognition Systems</i>, 835–42. Berlin: Springer.",
        "Lobb, Richard, Tim Bell, and David Bainbridge. 2005. “Fast Capture of Sheet Music for an Agile Digital Music Library.” In <i>Proceedings of the Sixth International Conference on Music Information Retrieval (ISMIR)</i>, 145–52. at London, UK.",
        "Rossant, Florence, and Isabelle Bloch. 2005. “Optical Music Recognition Based on a Fuzzy Modeling of Symbol Classes and Music Writing Rules.” In <i>Proceedings of the IEEE International Conference on Image Processing</i>. at Genoa, Italy.",
        "Szwoch, Mariusz. 2005. “A robust detector for distorted music staves.” In <i>Computer Analysis of Images and Patterns</i>, edited by André Gagalowicz and Wilfried Philips, 701–8. Berlin: Springer."
    ],
    "2004": [
        "Bellini, Pierfrancesco, Ivan Bruno, and Paolo Nesi. 2004. “An Off-Line Optical Music Sheet Recognition.” In <i>Visual Perception of Music Notation: Online and Offline Recognition</i>, edited by S. George. Hershey, PA: IRM Press.",
        "Clausen, Michael, and Frank Kurth. 2004. “A Unified Approach to Content-Based and Fault-Tolerant Music Recognition.” <i>IEEE Transactions on Multimedia</i> 6 (5):717–31.",
        "Droettboom, Michael, and Ichiro Fujinaga. 2004. “Symbol-Level Groundtruthing Environment for OMR.” In <i>Proceedings of the Fifth International Conference on Music Information Retrieval (ISMIR)</i>, 497–500. at London, UK.",
        "Fujinaga, Ichiro. 2004. “Staff Detection and Removal.” In <i>Visual Perception of Music Notation</i>, edited by Susan George, 1–39. Hershey: Idea Group Inc.",
        "George, Susan. 2004a. “Evaluation in the Visual Perception of Music Notation.” In <i>Visual Perception of Music Notation: On-Line and off-Line Recognition</i>, edited by Susan George, 304–49. Hershey, PA: IRM Press.",
        "George, Susan. 2004b. “Lyric Recognition Christian Music.” In <i>Visual Perception of Music Notation: On-Line and off-Line Recognition</i>, edited by Susan George, 128–226. Hershey, PA: IRM Press.",
        "George, Susan. 2004c. “Wavelets for Dealing with Super-Imposed Objects in Recognition of Music Notation.” In <i>Visual Perception of Music Notation: On-Line and off-Line Recognition</i>, edited by S. George, 78–107. Hershey, PA: IRM Press.",
        "Homenda, Wladyslaw, and K. Mossakowski. 2004. “Music Symbol Recognition: Neural Networks vs. Statistical Methods.” In <i>Proceedings of the EUROFUSE</i>. at Warszawa, Poland.",
        "Homenda, Wladyslaw, and Marcin Luckner. 2004a. “Automatic Recognition of Music Notation Using Methods of Centroids and Classification Trees.” In <i>Proceedings of the International Symposium on Computational Intelligence and Industrial Applications</i>. at Haikou, China.",
        "Homenda, Wladyslaw, and Marcin Luckner. 2004b. “Automatic Recognition of Music Notation Using Neural Networks.” In <i>Proceedings of the International Conference on AI and Systems</i>, 74–80. at Divnormorkoye, Russia.",
        "McKay, Cory, and Ichiro Fujinaga. 2004. “Automatic Genre Classification Using Large High-Level Musical Feature Sets.” In <i>Proceedings of the Fifth International Conference on Music Information Retrieval (ISMIR)</i>. Barcelona, Spain.",
        "Mitobe, Youichi, Hidetoshi Miyao, and Minoru Maruyama. 2004. “A Fast HMM Algorithm Based on Stroke Lengths for On-Line Recognition of Handwritten Music Scores.” In <i>Proceedings of the Ninth International Workshop on Frontiers in Handwriting Recognition</i>, 521–26. at Tokyo, Japan.",
        "Ng, Kia. 2004. “Optical Music Analysis for Printed Music Score and Handwritten Music Manuscript.” In <i>Visual Perception of Music Notation: On-Line and off-Line Recognition</i>, edited by Susan George, 108–27. Hershey, PA: IRM Press.",
        "Rossant, Florence, and Isabelle Bloch. 2004. “A Fuzzy Model for Optical Recognition of Musical Scores.” <i>Fuzzy Sets and Systems</i> 141 (2):165–201."
    ],
    "2003": [
        "Bainbridge, David, and Tim Bell. 2003. “A Music Notation Construction Engine for Optical Music Recognition.” <i>Software: Practice and Experience</i> 33 (2):173–200.",
        "Bruder, Ilvio, Andreas Finger, Andreas Heuer, and Temenushka Ignatova. 2003. “Towards a Digital Document Archive for Historical Handwritten Music Scores.” <i>Digital Libraries: Technology and Management of Indigenous Knowledge                for Global Access, 6th International Conference on Asian Digital Libraries, {ICADL} 2003, Kuala Lumpur, Malaysia, December 8-12, 2003, Proceedings</i>, Lecture Notes in Computer Science, 2911:411–14. <a href=\"https://doi.org/10.1007/978-3-540-24594-0\\_41\">https://doi.org/10.1007/978-3-540-24594-0\\_41</a>.",
        "Caldas, Pinto, Pedro Vieira João, and João Sousa. 2003. “A New Graph-like Classification Method Applied to Ancient Handwritten Musical Symbols.” <i>International Journal on Document Analysis and Recognition</i> 6 (1):10–22.",
        "Droettboom, Michael. 2003. “Correcting Broken Characters in the Recognition of Historical Printed Documents.” In <i>Proceedings of the Joint Conference on Digital Libraries, At</i>, 364–66. Houston, TX.",
        "Gao, Sheng, Namunu Maddage, and Chin-Hui Lee. 2003. “A Hidden Markov Model Based Approach to Music Segmentation and Identification.” In <i>Proceedings of the Joint Conference of the Fourth International Conference on Information, Communications and Signal Processing, and the Fourth Pacific Rim Conference on Multimedia</i>, 1576–80. at Singapore.",
        "George, Susan. 2003. “Online Pen-Based Recognition of Music Notation with Artificial Neural Networks.” <i>Computer Music Journal</i> 27 (2):70–79.",
        "Göcke, Roland. 2003. “Pattern Recognition and Applications.” In <i>Proceedings of the International Conference on Signal Processing</i>, 250–55. at Rhodes, Greece.",
        "Luckner, Marcin. 2003. <i>Automatic Identification of Selected Symbols of Music Notation</i>. Warsaw University of Technology.",
        "Riley, Jenn, and Ichiro Fujinaga. 2003. “Recommended Best Practices for Digital Image Capture of Musical Scores.” <i>OCLC Systems and Services</i> 19 (2):62–69."
    ],
    "2002": [
        "Barton, Lewis. 2002. “The Neumes Project: Digital Transcription of Medieval Chant Manuscripts.” In <i>Proceedings of the Web Delivering of Music (WEDELMUSIC)</i>, 211–18. Darmstadt, Germany.",
        "Droettboom, Michael, Ichiro Fujinaga, G.Sayeed Choudhury Karl MacMillan, M.Patton Tim DiLauro, and T. Anderson. 2002. “Using the Gamera Framework for the Recognition of Cultural Heritage Materials.” In <i>Proceedings of the 2nd ACM/IEEE-CS Joint Conference on Digital Libraries</i>, 17.",
        "Droettboom, Michael, Ichiro Fujinaga, and Karl MacMillan. 2002. <i>Optical Music Interpretation, Structural, Syntactic and Statistical Pattern Recognition</i>. Edited by T. Caelli, A. Amin, R. Duin, M. Kamel, and D. de Ridder. Berlin: Springer.",
        "Gezerlis, Velissarios, and Sergios Theodoridis. 2002. “Optical Character Recognition of the Orthodox Hellenic Byzantine Music Notation.” <i>Pattern Recognition</i> 35 (4):895–914.",
        "Luth, Nailja. 2002. “Automatic Identification of Music Notations.” In <i>Proceedings of the Second International Conference on Web Delivering of Music (WEDELMUSIC)</i>, 203–10.",
        "MacMillan, Karl, Michael Droettboom, and Ichiro Fujinaga. 2002. “Gamera: Optical Music Recognition in a New Shell.” In <i>Proceedings of the International Computer Music Conference</i>, 482–85.",
        "McPherson, John R. 2002. “Introducing Feedback into an Optical Music Recognition System.” In <i>Proceedings of the Third International Conference on Music Information Retrieval (ISMIR)</i>.",
        "Miyao, Hidetoshi. 2002. “Stave extraction for printed music scores.” In <i>Intelligent data engineering and automated learning</i>, edited by Hujun Yin, Nigel Allinson, Richard Freeman, John Keane, and Simon Hubbard, 562–68. Berlin: Springer.",
        "Ng, Kia, David Cooper, and Bee Ong. 2002. “Optical Music Analysis: A Reverse Engineering Approach.” In <i>Proceedings of the EVA</i>. at Florence, Italy.",
        "Ng, Kia. 2002a. “Document Imaging for Music Manuscript.” In <i>Proceedings of the Sixth World Multiconference on Systemics, Cybernetics and Informatics</i>. at Florida, USA.",
        "Ng, Kia. 2002b. “Music Manuscript Tracing.” In <i>Graphics Recognition Algorithms and Applications</i>, edited by Dorothea Blostein and Young-Bin Kwon, 330–42. Berlin: Springer.",
        "Rossant, Florence. 2002. “A Global Method for Music Symbol Recognition in Typeset Music Sheets.” <i>Pattern Recognition Letters</i> 23 (10):1129–41.",
        "Soak, Sang Moon, Seok Cheol Chang, Taehwan Shin, and Byung-Ha Ahn. 2002. “Music Recognition System Using Art-1 and GA.” In <i>Proceedings of SPIE</i>, 4734:171."
    ],
    "2001": [
        "Bainbridge, David, and and Tim Bell. 2001. “The Challenge of Optical Music Recognition.” <i>Computers and the Humanities</i> 35 (2):95–121.",
        "Bellini, Pierfrancesco, Ivan Bruno, and Paolo Nesi. 2001. “Optical Music Sheet Segmentation.” In <i>Proceedings of the First International Conference on Web Delivering of Music (WEDELMUSIC)</i>, 183–90. at Florence, Italy.",
        "Choudhury, G.Sayeed, Tim Dilauro, Michael Droettboom, Ichiro Fujinaga, and Karl Macmillan. 2001. “Strike up the Score.” <i>D-Lib Magazine</i> 7.",
        "Droettboom, Michael, and Ichiro Fujinaga. 2001. “Interpreting the Semantics of Music Notation Using an Extensible and Object-Oriented System.” In <i>Proceedings of the Ninth Python Conference</i>. at Long Beach, CA.",
        "Homenda, Wladyslaw. 2001. “Optical Music Recognition: The Case of Granular Computing.” In <i>Granular Computing: An Emerging Paradigm</i>, edited by W. Pedrycz, 341–60. Heidelberg: Physica-Verlag.",
        "MacMillan, Karl, Michael Droettboom, and Ichiro Fujinaga. 2001. “Gamera: A Structured Document Recognition Application Development Environment.” In <i>Proceedings of the Second Annual International Symposium on Music Information Retrieval (ISMIR)</i>, 15–16.",
        "McPherson, John R., and David Bainbridge. 2001. “Coordinating Knowledge within an Optical Music Recognition System.” In <i>Proceedings of the The 4th New Zealand Computer Science Research StudentsÕ Conference (NZCSRSCÕ01)</i>, 50–58. at Christchurch, New Zealand.",
        "Ng, Kia, David Cooper, and Bee Ong. 2001. “Towards an Integrated Handwritten Music Manuscript Analysis and Recognition System.” In <i>Proceedings of the Conference for Content Integrated Research in Creative User Systems (CIRCUS)</i>.",
        "Pugin, Laurent. 2001. <i>Réalisation d’un système de superposition de partitions de musique anciennes</i>. Geneva University.",
        "Su, Mu-Chun, Chee-Yuen Tew, and Hsin-Ha Chen. 2001. “Musical Symbol Recognition Using Som-Based Fuzzy Systems.” In <i>Proceedings of the IFSA World Congress and 20th NAFIPS International Conference</i>.",
        "Vieira, Pedro, and João Pintos Caldas. 2001. “Recognition of Musical Symbols in Ancient Manuscripts.” In <i>Proceedings of the International Conference on Image Processing</i>, 38–41. at Thessaloniki, Greece."
    ],
    "2000": [
        "Anquetil, Éric, and Bertrand Coüasnon. 2000. <i>A Symbol Classifier Able to Reject Wrong Shapes for Document Recognition Systems. Graphics Recognition Recent Advances</i>. Edited by Frédéric Dambreville, Atul K. Chhabra, and Dov Dori. Berlin: Springer.",
        "Caldas, Pinto, Pedro Vieira João, Mário Ramalho, Megan Mengucci, Pedro Pina, and Fernando Muge. 2000. “Ancient Music Recovery for Digital Libraries.” In <i>Research and Advanced Technology for Digital Libraries</i>. Berlin: Springer.",
        "Choudhury, G.Sayeed, Cynthia Requardt, Ichiro Fujinaga, Tim DiLauro, Elizabeth W. Brown, James W. Warner, and Brian Harrington. 2000. “Digital Workflow Management: The Lester s. Levy Digitized Collection of Sheet Music.” <i>First Monday</i> 5 (6).",
        "Choudhury, G.Sayeed, Tim DiLauro, Michael Droettboom, Ichiro Fujinaga, Brian Harrington, and Karl MacMillan. 2000. “Optical Music Recognition System within a Large-Scale Digitization Project.” In <i>Proceedings of the Proceedings ISMIR 00</i>.",
        "Cordella, Luigi, and Mari Vento. 2000. <i>Symbol and Shape Recognition, Graphics Recognition Recent Advances</i>. Berlin: Springer.",
        "Fotinea, Stavroula-Evita, George Giakoupis, Aggelos Liveris, Stylianos Bakamidis, and George Carayannis. 2000. “An Optical Notation Recognition Soystem for Printed Music Based on Template Matching and High Level Reasoning.” In <i>Proceedings of the Sixth Recherche d’Informations Assiste Par Ordinateur</i>. at Paris, France.",
        "Miyao, Hidetoshi, and Robert Haralick. 2000. “Format of Ground Truth Data Used in the Evaluation of the Results of an Optical Music Recognition System.” In <i>Proceedings of the IAPR Workshop on Document Analysis Systems</i>, 497–506. at Rio de Janeiro, Brazil.",
        "Muge, Fernando, I. Granado, Megan Mengucci, Pedro Pina, Vitorino Ramos, Nikolay Sirakov, João Caldas Pinto, et al. 2000. “Automatic Feature Extraction and Recognition for Digital Access of Books of the Renaissance.” In <i>Research and Advanced Technology for Digital Libraries</i>, edited by Joe Borbinha and Thomas Baker, 1–13. Berlin: Springer."
    ],
    "1999": [
        "Bainbridge, David, Craig Nevill-Manning, Ian Witten, Lloyd Smith, and Rodger McNab. 1999. “Towards a Digital Library of Popular Music.” In <i>Proceedings of the ACM Conference on Digital Libraries,</i> 161–69. Berkeley, CA.",
        "Bainbridge, David, and Kadir Wijaya. 1999. “Bulk Processing of Optically Scanned Music.” In <i>Proceedings of the Seventh International Conference on Image Processing and Its Applications</i>, 474–78. Manchester, UK.",
        "Beran, Tomáš, and Tomáš Macek. 1999. “Recognition of Printed Music Score.” In <i>Machine Learning and Data Mining in Pattern Recognition</i>. Berlin: Springer.",
        "Beran, Tomáš. 1999. <i>Rozpoznavani notoveho zapisu (in Czech)</i>. Czech Technical University.",
        "Blostein, Dorothea, and Lippold Haken. 1999. “Using Diagram Generation Software to Improve Diagram Recognition: A Case Study of Music Notation.” <i>IEEE Transactions on Pattern Analysis and Machine Intelligence</i> 21 (11):1121–36.",
        "Ferrand, Miguel, João Alexandre Leite, and Amilcar Cardoso. 1999a. “Hypothetical Reasoning: An Application to Optical Music Recognition.” In <i>Proceedings of the Joint Conference on Declarative Programming</i>, 367–81. at Aquila, Italy.",
        "Ferrand, Miguel, João Alexandre Leite, and Amilcar Cardoso. 1999b. “Improving Optical Music Recognition by Means of Abductive Constraint Logic Programming.” In <i>Progress in Artificial Intelligence</i>. Berlin: Springer.",
        "Hori, Toyokazu, Sinichiro Wada, Tai Howzan, Sun-Yuan D.E. Kung, K. Bastiaan, and W. 1999. “Automatic Music Score Recognition/Play System Based on Decision Based Neural Network.” In <i>Proceedings of the Third Workshop on Multimedia Signal Processing</i>, 183–84.",
        "Marinai, Simone, and Paolo Nesi. 1999. “Projection Based Segmentation of Musical Sheets.” In <i>Proceedings of the International Conference on Document Analysis and Recognition</i>, 515–18. at Bangalore, India.",
        "Mosterd, Eric. 1999. “Developing A New Way To Transfer Sheet Music Via The Internet.” University of South Dakota. <a href=\"https://mosterd.org/coursework/csc/thesis/thesis.pdf\">https://mosterd.org/coursework/csc/thesis/thesis.pdf</a>.",
        "Ng, Kia, David Cooper, Ewan Stefani, Roger Boyle, and Nick Bailey. 1999. “Embracing the Composer: Optical Recognition of Hand-Written Manuscripts.” In <i>Proceedings of the International Computer Music Conference</i>, 500–503. at Beijing, China.",
        "Stückelberg, Marc, and David Doermann. 1999. “On Musical Score Recognition Using Probabilistic Reasoning.” In <i>Proceedings of the Fifth International Conference on Document Analysis and Recognition</i>, 115–18. at Bangalore India.",
        "Stückelberg, Marc. 1999. <i>Musical Score Recognition Using Probabilistic Inference</i>.",
        "Wijaya, Kenny, and David Bainbridge. 1999. “Staff Line Restoration.” In <i>Seventh International Conference on Image Processing and Its Applications</i>, 2:760–64."
    ],
    "1998": [
        "Bainbridge, David, and Stuart Inglis. 1998. “Musical Image Compression.” In <i>Proceedings of the Data Compression Conference, at Snowbird</i>, 209–18. UT.",
        "Chhabra, Atul. 1998. <i>Graphic symbol recognition: An overview, Graphics recognition algorithms and systems</i>. Berlin: Springer.",
        "Fahmy, Hoda, and Dorothea Blostein. 1998. “A Graph-Rewriting Paradigm for Discrete Relaxation: Application to Sheet-Music Recognition.” <i>International Journal of Pattern Recognition and Artificial Intelligence</i> 12 (6):763–99.",
        "Ferrand, Miguel, and Amilcar Cardoso. 1998. “Scheduling to Reduce Uncertainty in Syntactical Music Structures.” In <i>14th Brazilian Symposium on Artificial Intelligence</i>, 249–58.",
        "Fujinaga, Ichiro, S. Moore, and D. Sullivan. 1998. “Implementation of Exemplar-Based Learning Model for Music Cognition.” In <i>Proceedings of the International Conference on Music Perception and Cognition</i>, 171–79. at Seoul, South Korea.",
        "Kinoshita, Tomoyoshi, Hideya Muraoka, and Hidehiko Tanaka. 1998. “Note Recognition Using Statistical Information of Musical Note Transitions.” <i>Journal of the Acoustical Society of Japan</i> 54 (3):190–98.",
        "Leite, João, Miguel Ferrand, and Amilcar Cardoso. 1998. <i>Riem: A system for recognition and interpretation of music writing (in Portuguese)</i>. Dept. Engenharia Informatica, Faculdade de Cincias e Tecnologia, Universidade de Coimbra.",
        "Sawaki, Minako, Hiroshi Murasei, Norihiro Hagita, and Kenichiro Ishii. 1998. “A Study on Syakuhachi Score Recognition with Embedded Symbols.” <i>Transactions of the Institute of Electronics, Information and Communication Engineers</i> 81 (10):2480–82."
    ],
    "1997": [
        "Bainbridge, David, and Nicholas Carter. 1997. <i>Automatic Reading of Music Notation, Handbook of Character Recognition and Document Image Analysis</i>. Edited by Horst Bunke and and Patrick Wang. Singapore: World Scientific.",
        "Bainbridge, David, and Tim Bell. 1997. “Dealing with Superimposed Objects in Optical Music Recognition.” In <i>Proceedings of the Sixth International Conference on Image Processing and Its Applications</i>, 756–60.",
        "Beran, Tomáš. 1997. <i>Rozpoznavani notoveho zapisu (in czech)</i>. Czech Technical University.",
        "Sokei, Sanetoshi, Tsuyoshi Yamashiro, Zensei Iha, and Minoru Toguchi. 1997. <i>Study of recognition for okinawa syamisen score kunkunsi</i>.",
        "Stückelberg, Marc, Christian Pellegrini, and Mélanie Hilario. 1997. “An Architecture for Musical Score Recognition Using High-Level Domain Knowledge.” In <i>Proceedings of the Fourth International Conference on Document Analysis and Recognition</i>, 2:813–18.",
        "Stückelberg, Marc, Christian Pellegrini, and Mélanie Hillario. 1997. <i>A Preview of an Architecture for Musical Score Recognition</i>. CUI, University of Geneva, Geneva, Switzerland."
    ],
    "1996": [
        "Anstice, Jamie, Tim Bell, Andy Cockburn, and Martin Setchell. 1996. “The Design of a Pen-Based Musical Input System.” In <i>Proceedings Sixth Australian Conference on Computer-Human Interaction</i>, 260–67.",
        "Bainbridge, David, and Tim Bell. 1996. “An Extensible Optical Music Recognition System.” <i>Australian Computer Science Communications</i> 18 (1):308–17.",
        "Bainbridge, David. 1996. “Optical Music Recognition: A Generalised Approach.” In <i>Proceedings of the Second New Zealand Computer Science Graduate Conference</i>.",
        "Cho, Kyung Eun Cho, (K)Huyng Je. 1996. “Recognition of Piano Score Using Skeletal Lines and Run-Length Information.” <i>Journal of KISS(C) (Computing Practices)</i> 2 (4):461–73.",
        "Coüasnon, Bertrand. 1996. “Formalisation grammaticale de la connaissance a priori pour l’analyse de documents: Application aux partitions d’orchestre.” In <i>Reconnaissance des Formes et Intelligence Artificielle</i>, 465–74.",
        "Fujinaga, Ichiro. 1996a. “Adaptive Optical Music Recognition.” <i>IEEE Transactions on Systems, Man, and Cybernetics</i>.",
        "Fujinaga, Ichiro. 1996b. “Exemplar-Based Learning in Adaptive Optical Music Recognition System.” In <i>International Computer Music Conference</i>, 55–56.",
        "Grande, Cindy, and Alan Belkin. 1996. “The Development of the Notation Interchange File Format.” <i>Computer Music Journal</i> 20 (4):33. <a href=\"https://doi.org/10.2307/3680416\">https://doi.org/10.2307/3680416</a>.",
        "Homenda, Wladyslaw. 1996. “Automatic recognition of printed music and its conversion into playable music data.” <i>Control and Cybernetics</i> 25 (2):353–67.",
        "Miyao, Hidetoshi, and Yasuaki Nakano. 1996. “Note Symbol Extraction for Printed Piano Scores Using Neural Networks.” <i>IEICE Transactions on Information and Systems</i> 79 (5):548–54.",
        "Modayur, Bharath. 1996. “Music Score Recognition: A Selective Attention Approach Using Mathematical Morphology.” EE Dept, FT-10 University of Washington: Intelligent Systems Laboratory.",
        "Ng, Kia, Roger Boyle, and David Cooper. 1996. “Handwritten Music Manuscript Recognition.” In <i>Proceedings of the International Computer Music Conference</i>, 354–57. at Hong Kong, China.",
        "Ng, Kia, and Roger David Boyle. 1996. “Recognition and Reconstruction of Primitives in Music Scores.” <i>Image and Vision Computing</i> 14 (1):39–46.",
        "Reed, Todd K., and James Parker. 1996. “Automatic Computer Recognition of Printed Music.” In <i>13th International Conference on Pattern Recognition</i>, 3:803–7.",
        "Yadid-Pecht, Orly, Moti Gerner, Lior Dvir, Eliyahu Brutman, and Uri Shimony. 1996. “Recognition of Handwritten Musical Notes by a Modified Neocognitron.” In <i>Machine Vision and Applications</i>, 9:65–72. 2."
    ],
    "1995": [
        "Bainbridge, David. 1995. <i>Optical Music Recognition: Progress Report 2</i>. Department of Computer Science, University of Canterbury, NZ.",
        "Baumann, Stephan, and Karl Tombre. 1995. <i>Report of the Line Drawing and Music Recognition Working Group</i>. World Scientific.",
        "Baumann, Stephan. 1995. “A Simplified Attributed Graph Grammar for High-Level Music Recognition.” In <i>Proceedings of the Third International Conference on Document Analysis and Recognition</i>, 2:1080–83.",
        "Capitaine, Thierry, E. Mouaddib, Harold Trannois, and André Lebrun. 1995. “Automatic Recognition of Musical Scores.” In <i>Second Asian Conference on Computer Vision</i>, 1:422–24.",
        "Coüasnon, Bertrand, Brisset Pascal, and Igor Stephan. 1995. “Using Logic Programming Languages for Optical Music Recognition.” In <i>International Conference on the Practical Application of Prolog</i>, 115–34.",
        "Coüasnon, Bertrand, and Bernard Rétif. 1995a. “Using a Grammar for a Reliable Full Score Recognition System.” In <i>International Computer Music Conference</i>, 187–94.",
        "Coüasnon, Bertrand, and Bernard Rétif. 1995b. “Utilisation d’une grammaire dans la reconnaissance de partitions d’orchestre.” In <i>Deuxièmes Journées d’Informatique Musicale</i>, 143–52.",
        "Coüasnon, Bertrand, and Jean Camillerapp. 1995. “A Way to Separate Knowledge from Program in Structured Document Analysis: Application to Optical Music Recognition.” In <i>International Conference on Document Analysis and Recognition</i>, 1092–97.",
        "Homenda, Wladyslaw. 1995. “Optical Pattern Recognition for Printed Music Notation.” In <i>Proceedings of the SPIE</i>, 2490:230–39.",
        "Kopec, Gary, Philip Chou, and David Maltz. 1995. “Markov Source Model for Printed Music Decoding.” In <i>Proceedings of the SPIE</i>, 2422:115–25.",
        "Miyao, Hidetoshi, and Yasuaki Nakano. 1995. “Head and Stem Extraction from Printed Music Scores Using a Neural Network Approach.” In <i>Proceedings of the Third International Conference on Document Analysis Recognition</i>, 1074–79. at Montreal, QC.",
        "Ng, Kia, Roger Boyle, and David Cooper. 1995a. “Automated Optical Musical Score Recognition and Its Enhancement Using High-Level Musical Knowledge.” In <i>Proceedings of the XI Colloquium on Musical Informatics</i>, 167–70. at Bologna, Italy.",
        "Ng, Kia, Roger Boyle, and David Cooper. 1995b. “Low- and High-Level Approaches to Optical Music Score Recognition.” In <i>IEEE Colloquium on Document Image Processing and Multimedia Environments</i>, 3:1–6.",
        "Reed, Todd K. 1995. <i>Optical Music Recognition</i>. University of Calgary.",
        "Seales, William, and Arcot Rajasekar. 1995. “Interpreting Music Manuscripts: A Logic-Based, Object-Oriented Approach.” In <i>Proceedings of the Third International Computer Science Conference on Image Analysis Applications and Computer Graphics</i>, 181–88.",
        "Wilk, Randy. 1995. <i>Converting Graphic Musical Data to a Machine Playable Form</i>. McGill University."
    ],
    "1994": [
        "Andecy, Vincent Poulain d’, Jean Camillerapp, and Ivan Leplumey. 1994a. “Détecteur robuste de segments-application l’analyse de partitions musicales.” In <i>9ème Congrès AFCET Reconnaissance des Formes et Intelligence Artificielle</i>.",
        "Andecy, Vincent Poulain d’, Jean Camillerapp, and Ivan Leplumey. 1994b. “Kalman Filtering for Segment Detection: Application to Music Scores Analysis.” In <i>Proceedings of the 12th IAPR International Conference on Pattern Recognition</i>, 301–5.",
        "Bainbridge, David. 1994a. <i>A Complete Optical Music Recognition System: Looking to the Future</i>.",
        "Bainbridge, David. 1994b. <i>Optical Music Recognition: Progress Report 1</i>. Department of Computer Science, University of Canterbury, NZ.",
        "Carter, Nicholas P. 1994a. “Conversion of the Haydn Symphonies into Electronic Form Using Automatic Score Recognition: A Pilot Study.” In <i>Proceedings of SPIE</i>, 2181:279–90.",
        "Carter, Nicholas P. 1994b. “Music Score Recognition: Problems and Prospects.” <i>Computing in Musicology</i> 9:152–58.",
        "Coüasnon, Bertrand, and Jean Camillerapp. 1994. “Using Grammars to Segment and Recognize Music Scores.” In <i>International Association for Pattern Recognition Workshop on Document Analysis Systems</i>, 15–27.",
        "Fahmy, Hoda, and Dorothea Blostein. 1994. “A Graph-Rewriting Approach to Discrete Relaxation: Application to Music Recognition.” In <i>Proceedings of the SPIE</i>, 2181:291–302.",
        "Goolsby, Thomas W. 1994a. “Eye Movement in Music Reading: Effects of Reading Ability, Notational Complexity, and Encounters.” <i>Music Perception</i> 12 (1):77–96.",
        "Goolsby, Thomas W. 1994b. “Profiles of Processing: Eye Movements during Sightreading.” <i>Music Perception</i> 12 (1):97–123.",
        "Lee, Soo-Young, and J. Shin. 1994. “Recognition of Music Scores Using Neural Networks.” <i>Journal of the Korea Information Science Society</i> 21 (7):1358–66.",
        "McGee, William F. 1994. “Musicreader: An Interactive Optical Music Recognition System.” In <i>Computing in Musicology</i>, 9:146–51.",
        "Musitek. 1994. “Musitek.” <i>Keyboard</i> 20 (3):136.",
        "Ng, Kia, and Roger David Boyle. 1994. <i>Reconstruction of Music Scores from Primitive Sub-Segmentation</i>.",
        "Roth, Martin. 1994. <i>An Approach to Recognition of Printed Music</i>. Swiss Federal Institute of Technology.",
        "Selfridge-Field, Eleanor. 1994a. “How Practical Is Optical Music Recognition as an Input Method?” In <i>Computing in Musicology</i>, 9:159–66. 1993–94.",
        "Selfridge-Field, Eleanor. 1994b. “Optical Recognition of Musical Notation: A Survey of Current Work.” In <i>Computing in Musicology</i>, 9:109–45.",
        "Watkins, Greg. 1994. “A Fuzzy Syntactic Approach to Recognising Hand-Written Music.” In <i>Proceedings of the International Computer Music Conference</i>, 297–302.",
        "Wright, D.James. 1994. <i>Optical music recognition: A deterministic, object-oriented approach</i>. University of Victoria."
    ],
    "1993": [
        "Andecy, Vincent Poulain d’. 1993. <i>Segmentation et reconnaissance optique de partitions musicales</i>. Rennes, France: IRISA/INSA.",
        "Armand, Jean-Pierre. 1993. “Musical Score Recognition: A Hierarchical and Recursive Approach.” In <i>Proceedings of the Second International Conference on Document Analysis and Recognition</i>, 906–9.",
        "Baumann, Stephan. 1993. “Document recognition of printed scores and transformation into MIDI.” In <i>Proceedings of the Deutsches Forschungszentrum fuer Kuenstliche Intelligenz GmbH (DFKI)</i>. Kaiserslautern.",
        "Carter, Nicholas P. 1993. <i>A Generalized Approach to Automatic Recognition of Music Scores</i>. Department of Music, Stanford University.",
        "Clarke, Alastair T., B.Malcolm Brown, and Michael P. Thorne. 1993. “Recognising Musical Text.” In <i>Proceedings of the SPIE</i>, 2064:222–33.",
        "Distasi, Riccardo, Michele Nappi, and Sergio Vitulano. 1993. “An Automatic System for Reading Musical Scores.” In <i>Proceedings of the Eighth Scandinavian Conference on Image Analysis</i>, 1307–10.",
        "Distasi, Riccardo, and et al. 1993. “Automatic System for Reading Scores.” In <i>Eighth Scandinavian Conference on Image Analysis</i>, 1307–10.",
        "Fahmy, Hoda, and Dorothea Blostein. 1993. “A Graph Grammar Programming Style for Recognition of Music Notation.” <i>Machine Vision and Applications</i> 6:83–99.",
        "Fujinaga, Ichiro. 1993. “Optical Music Recognition System Which Learns.” In <i>Proceedings of the SPIE</i>, 1785:210–17.",
        "Geggus, Karl Michael, and Elizabeth C. Botha. 1993. “A Model-Based Approach to Sheet Music Recognition.” <i>Elektron</i> 10 (1):25–29.",
        "Kobayakawa, Tatsu. 1993. “Auto Music Score Recognition System.” In <i>Proceedings SPIE: Character Recognition Technologies</i>, 1906:112–23.",
        "Leplumey, I., and G.Lorette Jean Camillerapp. 1993. “A Robust Detector for Music Staves.” In <i>Proceedings of the International Conference on Document Analysis and Recognition</i>, 902–5.",
        "Modayur, Bharath R., Visvanathan Ramesh, Robert Martin Haralick, and Linda G. Shapiro. 1993. “Muser: A Prototype Musical Recognition System Using Mathematical Morphology.” In <i>Machine Vision and Applications</i>, 6:140–50. 2–3.",
        "Newell, Christopher, and Homenda Wladyslaw. 1993. <i>Midiscan for Windows</i>.",
        "Perrotti, Francesco Artur, and Roberto de Alencar Lotufo. 1993. “Pre-processamento, exctracao de atributos e primeiro nivel de classiccao para un sistema de reconhecimento otico de simbolos musicais.” In <i>Proceedings of the VI Brazilian Symposium in Computer Graphics and Image Processing (SINGRAPI)</i>.",
        "Randriamahefa, R., C.Fluhr Jean-Pierre Cocquerez, F. Pépin, and S. Philipp. 1993. “Printed Music Recognition.” In <i>Proceedings of the International Conference on Document Analysis and Recognition</i>, 898–901. at Tsukuba, Japan."
    ],
    "1992": [
        "Baumann, Stephan, and Andreas Dengel. 1992. “Transforming Printed Piano Music into Midi.” In <i>Proceedings of International Workshop on Structural and Syntactic Pattern Recognition</i>, 363–72.",
        "Blostein, Dorothea, and Henry S. Baird. 1992. “A Critical Survey of Music Image Analysis.” In <i>Structured Document Image Analysis</i>, edited by Henry S. Baird, Horst Bunke, and Kazuhiko Yamamoto. Berlin: Springer.",
        "Blostein, Dorothea, and Nicholas Carter. 1992. <i>Recognition of Music Notation: Sspr ’90 Working Group Report, Structured Document Image Analysis</i>. Edited by Henry Baird, Horst Bunke, and Kazuhiko Yamamoto. Berlin: Springer Verlag.",
        "Bulis, Alex, Roy Almog, Moti Gerner, and Uri Shimony. 1992. “Computerized Recognition of Hand-Written Musical Notes.” In <i>Proceedings of the International Computer Music Conference</i>, 110–12.",
        "Carter, Nicholas P. 1992a. “A New Edition of Walton’s Façade Using Automatic Score Recognition.” In <i>Proceedings of International Workshop on Structural and Syntactic Pattern Recognition</i>, 352–62.",
        "Carter, Nicholas P. 1992b. “Segmentation and Preliminary Recognition of Madrigals Notated in White Mensural Notation.” <i>Machine Vision and Applications</i> 5 (3):223–30.",
        "Carter, Nicholas, and Richard Bacon. 1992. “Automatic Recognition of Printed Music.” In <i>Structured Document Image Analysis</i>, edited by Henry Baird, Horst Bunke, and Kazuhiko Yamamoto. Berlin: Springer.",
        "Di, Riso and Giuseppe. 1992. <i>Lettura automatica di partiture musicali</i>. Universit di Salerno.",
        "Fahmy, Hoda, and Dorothea Blostein. 1992. “Graph Grammar Processing of Uncertain Data.” In <i>Proceedings of International Workshop on Structural and Syntactic Pattern Recognition</i>, 373–82.",
        "Fujinaga, Ichiro, Bo Alphonce, Glendon Diener, and Bruce Pennycook. 1992. “Optical Music Recognition on next Workstation.” In <i>Proceedings of the Second International Conference on Music Perception and Cognition</i>. at Los Angeles, CA.",
        "Fujinaga, Ichiro, Bo Alphonce, and Bruce Pennycook. 1992. “Interactive Optical Music Recognition.” In <i>Proceedings of the International Computer Music Conference</i>, 117–20.",
        "Fujinaga, Ichiro. 1992. “An Optical Music Recognition System That Learns.” In <i>Proceedings of SPIE, Enabling Technologies for High-Bandwidth Applications</i>, 1785:210–17. Boston: MA.",
        "Itagaki, Takebumi, Shuji Hashimoto, Masayuki Isogai, and Sadamu Ohteru. 1992. “Automatic Recognition of Several Types of Musical Notation.” In <i>Structured Document Image Analysis</i>, edited by Henry Baird, Horst Bunke, and Kazuhiko Yamamoto, 466–76. Berlin: Springer-Verlag.",
        "Kasturi, Rangachar, and Lawrence O’Gorman. 1992. “Document image analysis techniques.” In <i>Machine Vision and Applications</i>, 5:141–42. 3.",
        "Kato, Hirokazu, and Seiji Inokuchi. 1992. “A Recognition System for Printed Piano Music Using Musical Knowledge and Constraints, Structured Document Image Analysis.” In <i>Structured Document Image Analysis</i>, edited by Henry S. Baird, Horst Bunke, and Kazuhiko Yamamoto, 435–55. Berlin: Springer-Verlag.",
        "Martin, Philippe, and Camille Bellissant. 1992. “Neural Networks for the Recognition of Engraved Musical Scores.” <i>International Journal of Pattern Recognition and Artificial Intelligence</i> 6 (1):193–208.",
        "Martin, Philippe. 1992. “Réseaux de neurones artificiels: Application la reconnaissance optique de partitions musicales.” PhD Thesis, Institut IMAG.",
        "Matsushima, Toshiaki. 1992. “Computerized Japanese Traditional Music Processing System.” In <i>Proceedings of the International Computer Music Conference</i>, 121–24.",
        "Miyao, Hidetoshi T., T. Ejima, M. Miyahara, and K. Kotani. 1992. “Symbol Recognition for Printed Piano Scores Based on the Musical Knowledge (in Japanese).” <i>Transactions of the Institute of Electronics, Information and Communication Engineers D-II</i> 75 (11):1848–55.",
        "Modayur, Bharath R., Robert Martin Haralick, and Linda G. Shapiro. 1992. “On Printed Music Score Symbol Recognition.” In <i>Proceedings of the Symposium on Document Analysis and Information Retrieval</i>, 16–18.",
        "Modayur, Bharath R., Visvanathan Ramesh, Robert Martin Haralick, and Linda G. Shapiro. 1992. “Muser-a Prototype Musical Recognition System Using Mathematical Morphology.” EE Dept, FT-10 University of Washington: Intelligent Systems Laboratory.",
        "Ng, Kia, and Roger David Boyle. 1992. “Segmentation of Music Primitives.” In <i>Proceedings of the British Machine Vision Conference</i>, 472–80. at Leeds, UK.",
        "Roth, Martin. 1992. <i>OMR-Optical Music Recognition</i>. Swiss Federal Institute of Technology.",
        "Sicard, Etienne. 1992. “An Efficient Method for the Recognition of Printed Music.” In <i>Proceedings of 11th International Conference on Pattern Recognition (IAPR)</i>, 573–76.",
        "Stevens, Catherine, and Cyril Latimer. 1992. “A Comparison of Connectionist Models of Music Recognition and Human Performance.” <i>Minds and Machines</i> 2 (4):379–400.",
        "Wolman, (J) Amnon, James Choi, Shahab Asgharzadeh, and Jason Kahana. 1992. “Recognition of Handwritten Music Notation.” In <i>Proceedings of the International Computer Music Conference</i>, 125–27.",
        "Yadid-Pecht, Orly, Eliyahu Brutman, Lior Dvir, Moti Gerner, and Uri Shimony. 1992. “Ramit: Neural Network for Recognition of Musical Notes.” In <i>Proceedings of the International Computer Music Conference</i>, 128–31."
    ],
    "1991": [
        "Bainbridge, David. 1991. <i>Preliminary Experiments in Musical Score Recognition</i>. University of Edinburgh.",
        "Blostein, Dorothea, and Lippold Haken. 1991. “Justification of Printed Music.” <i>Communications of the ACM</i> 34 (3):88–99.",
        "Carter, Nicholas. 1991. “Automatic Recognition and Related Topics: Guildford.” <i>Computing in Musicology</i> 7:109–11.",
        "Choi, James. 1991. <i>Optical Recognition of the Printed Musical Score</i>. University of Illinois at Chicago.",
        "Coüasnon, Bertrand. 1991. <i>Réseaux de neurones appliqués à la reconnaissance de partitions musicales</i>. Université de Rennes: Irisa.",
        "Fahmy, Hoda, and Dorothea Blostein. 1991. “A Graph Grammar for High-Level Recognition of Music Notation.” <i>First International Conference on Document Analysis</i> 1:70–78.",
        "Fahmy, Hoda. 1991. <i>A Graph-Grammar Approach to High-Level Music Recognition</i>. Queen’s University.",
        "Fujinaga, Ichiro, Bo Alphonce, Bruce Pennycook, and Kharim Hogan. 1991. “Optical Music Recognition: Progress Report.” In <i>Proceedings of the International Computer Music Conference</i>, 66–73. at Montreal, QC.",
        "Fujinaga, Ichiro, Bruce Pennycook, and Bo Alphonce. 1991. “The Optical Music Recognition Project.” In <i>Computers in Music Research</i>, 3:139–42.",
        "Leplumey, I., and Jean Camillerapp. 1991a. “Comparison of Region Labelling for Musical Scores.” In <i>First International Conference on Document Analysis</i>, 2:674–82.",
        "Leplumey, I., and Jean Camillerapp. 1991b. “Coopration entre la segmentation des régions blanches et des régions noires pour l’analyse de partitions musicales.” In <i>8ème Congrès Reconnaissance des Formes et Intelligence Artificielle</i>, 3:1045–52.",
        "Martin, Philippe, and Camille Bellissant. 1991a. “Low-Level Analysis of Music Drawing Images.” In <i>International Conference on Document Analysis and Recognition</i>, 417–25.",
        "Martin, Philippe, and Camille Bellissant. 1991b. “Neural Networks at Different Levels of Musical Score Image Analysis System.” In <i>Seventh Scandinavian Conference on Image Analysis</i>, 1102–9.",
        "McGee, William, and Paul Merkley. 1991. “The Optical Scanning of Medieval Music.” <i>Computers and the Humanities</i> 25 (1):47–53.",
        "McLean, Graeme. 1991. <i>Music Recognition</i>. Heriot-Watt University.",
        "Rothstein, Joseph. 1991. “Coda Finale-PC 2.0 Notation Software for IBM PCs.” <i>Computer Music Journal</i> 15 (4):115. <a href=\"https://doi.org/10.2307/3681091\">https://doi.org/10.2307/3681091</a>.",
        "Ruttenberg, Alan. 1991. <i>Optical Reading of Typeset Music</i>. Massachusetts Institute of Technology."
    ],
    "1990": [
        "Akiyama, Taz, and Norihiro Hagita. 1990. “Automated Entry System for Printed Documents.” <i>Pattern Recognition</i> 23 (11):1141–54.",
        "Blostein, Dorothea, and Lippold Haken. 1990. “Template Matching for Rhythmic Analysis of Music Keyboard Input.” In <i>Proceedings of 10th International Conference on Pattern Recognition</i>, 767–70.",
        "Carter, Nicholas P., and Richard A. Bacon. 1990. “Automatic Recognition of Music Notation.” In <i>Proceedings of the International Association for Pattern Recognition Workshop on Syntactic and Structural Pattern Recognition</i>, 482.",
        "Clarke, Alastair, Malcolm Brown, and Michael Thorne. 1990. “Problems to Be Faced by Developers of Computer Based Automatic Music Recognisers.” In <i>Proceedings of the International Computer Music Conference</i>, 345–47.",
        "Hewlett, Walter B., and Eleanor Selfridge-Field. 1990. “Optical Recognition of Musical Data.” In <i>Computing in Musicology: A Directory of Research</i>, 36–45.",
        "Inokuchi, Seiji, and Haruhiro Katayose. 1990. “Computer and Music.” <i>Journal of the Institute of Electronics, Information and Communication Engineers</i> 73 (9):965–67.",
        "Itagaki, Takebumi S., Shuji Hashimoto, Masayuki Isogai, and Sadamu Ohteru. 1990. “Automatic Recognition on Some Different Types of Musical Notation.” In <i>Proceedings of the International Association for Pattern Recognition Workshop on Syntactic and Structural Pattern Recognition</i>, 488.",
        "Katayose, Haruhiro, T. Fukuoka, K. Takami, and Seiji Inokuchi. 1990. “Expression Extraction in Virtuoso Music Performances.” In <i>Proceedings of the Tenth International Conference on Pattern Recognition</i>, 780–84.",
        "Kato, Hirokazu, and Seiji Inokuchi. 1990. “The Recognition System for Printed Piano Music Using Musical Knowledge and Constraints.” In <i>Proceedings of the International Association for Pattern Recognition Workshop on Syntactic and Structural Pattern Recognition</i>, 231–48.",
        "Miyao, Hidetoshi T., T. Ejima, M. Miyahara, and K. Kotani. 1990. <i>Recognition for Printed Piano Scores (in Japanese)</i>. Vol. 34. 90–74.",
        "Pennycook, Bruce. 1990. “Towards Advanced Optical Music Recognition.” <i>Advanced Imaging</i>, 54–57.",
        "Richard, Dominique M. 1990. “Godel Tune: Formal Models in Music Recognition Systems.” In <i>ICMC Glasgow 1990 Proceedings</i>, 338–40.",
        "Sawada, Hideyuki, Toshiaki Matsushima, Takebumi Itakagi, and Sadamu Ohteru. 1990. “A Practical Bilateral Translation System between Printed Music and Braille.” In <i>Proceedings of Sixth International Workshop on Computer Applications for the Visually Handicapped</i>."
    ],
    "1989": [
        "Clarke, Alastair, Malcolm B. Brown, and Michael Thorne. 1989. “Coping with Some Really Rotten Problems in Automatic Music Recognition.” <i>Microprocessing &amp; Microprogramming</i> 27 (1–5):547–50.",
        "Fujinaga, Ichiro, Bo Alphonce, Bruce Pennycook, and Nathalie Boisvert. 1989. “Optical Recognition of Music Notation by Computer.” In <i>Computers in Music Research</i>, 1:161–64.",
        "Fujinaga, Ichiro, Bo Alphonce, and Bruce Pennycook. 1989. “Issues in the Design of an Optical Music Recognition System.” In <i>Proceedings of the International Computer Music Conference</i>, 113–16.",
        "Fujinaga, Ichiro, Bruce Pennycook, and Bo Alphonce. 1989. “Computer Recognition of Musical Notation.” In <i>Proceedings of the First International Conference on Music Perception and Cognition</i>, 87–90. at Kyoto, Japan.",
        "Glass, S. 1989. <i>Optical Music Recognition</i>. University of Canterbury.",
        "Katayose, Haruhiro, Hirokazu Kato, Masakazu Imai, and Seiji Inokuchi. 1989. “An Approach to an Artificial Music Expert.” In <i>Proceedings of the International Computer Music Conference</i>, 139–46.",
        "Katayose, Haruhiro, and Seiji Inokuchi. 1989. “The kansei music system.” <i>Computer Music Journal</i> 13 (4):72–77.",
        "Martin, Philippe. 1989. “Reconnaissance de partitions musicales et réseaux de neurones: Une étude.” In <i>Actes 7 ième Congrs AFCET de Reconnaissance des Formes et Intelligence Artificielle</i>, 217–26.",
        "Matsushima, Toshiaki, Sadamu Ohteru, and Shuji Hashimoto. 1989. “An Integrated Music Information Processing System.” In <i>Proceedings of the International Computer Music Conference</i>, 191–98.",
        "McGee, William F., and P. Merkley. 1989. <i>Optical Recognition of Music Using Page Straightening</i>.",
        "Nagy, George. 1989. “Document Analysis and Optical Character Recognition.” In <i>Fifth International Conference on Image Analysis and Processing</i>, 511–29.",
        "Yin, F., G. Qingshi, and Z. Xiang. 1989. “Principle on designing the music reading system (in Chinese).” <i>Mini-Micro Systems</i> 10 (12):1–10."
    ],
    "1988": [
        "Alphonce, Bo, Bruce Pennycook, Ichiro Fujinaga, and Nathalie Boisvert. 1988. “Optical Music Recognition: A Progress Report.” In <i>Proceedings of the Small Computers in the Arts</i>, 8–12.",
        "Bacon, Richard A., and Nicholas P. Carter. 1988. “Recognising Music Automatically.” <i>Physics Bulletin</i> 39:265.",
        "Carter, Nicholas, Richard Bacon, and Thomas Messenger. 1988. “The Acquisition, Representation and Reconstruction of Printed Music by Computer: A Review.” <i>Computers and the Humanities</i> 22 (2):117–36.",
        "Clarke, Alastair T., B.Malcolm Brown, and Michael P. Thorne. 1988a. “Inexpensive Optical Character Recognition of Music Notation: A New Alternative for Publishers.” In <i>Proceedings of the Computers in Music Research Conference</i>, 84–87.",
        "Clarke, Alastair T., B.Malcolm Brown, and Michael P. Thorne. 1988b. “Using a micro to automate data acquisition in music publishing.” <i>Microprocessing and Microprogramming</i> 24:549–54.",
        "Fletcher, Lloyd Alan, and Rangachar Kasturi. 1988. “A Robust Algorithm for Text String Separation from Mixed Text/Graphics Images.” <i>IEEE Transactions on Pattern Analysis and Machine Intelligence</i> 10 (6):910–18.",
        "Fluhr, Christian, and J. Abouassly. 1988. “Music Pattern Recognition.” In <i>Proceedings of the EEC Concerted Action on Technology and Blindness</i>. at Toulouse, France.",
        "Fujinaga, Ichiro. 1988. <i>Optical Music Recognition Using Projections</i>. McGill University.",
        "Kato, Hirokazu, and Seiji Inokuchi. 1988. “Automatic Recognition of Printed Piano Music Based on Bar Unit Processing (in Japanese).” <i>Transactions of I. E. C. E</i> 71 (5):894–901.",
        "Matsushima, Toshiaki. 1988. “Automatic Printed-Music-to-Braille Translation System.” <i>Journal of Information Processing</i> 11 (4):249–57.",
        "Ohteru Sadamu. 1988. “Data entry and automatic recognition of music score (in Japanese).” <i>Journal of the Information Processing Society of Japan</i> 29 (6):586–92.",
        "Ostenstad, Berge. 1988. <i>Oppdeling av abjektene I et digitalt notebilde I klassifiserbare enheter (in Norwegian)</i>. Institute of Informatics, Oslo, Norway.",
        "Roach, John W., and James E. Tatem. 1988. “Using Domain Knowledge in Low-Level Visual Processing to Interpret Handwritten Music: An Experiment.” <i>Pattern Recognition</i> 21 (1):33–44.",
        "Thorud, Elise. 1988. <i>Analyse Av Notebilder (in Norwegian)</i>. Institute of Informatics, Oslo, Norway."
    ],
    "1987": [
        "Hachimura, Kozaburo, and Yutaka Ohno. 1987. “A system for the representation of human body movements from dance scores.” <i>Pattern Recognition Letters</i> 5:1–9.",
        "Kim, Woong-Tae J., Myung Jin Chung, and Zeungnam Bien. 1987. “Recognition System for a Printed Music Score.” In <i>Proceedings of TENCON 87: 1987 IEEE Region 10 Conference ’Computers and Communications Technology Toward</i>, 2000:573–77.",
        "Martin, Neil G. 1987. <i>Towards Computer Recognition of the Printed Musical Score</i>. Thames Polytechnic.",
        "Ohteru Sadamu. 1987. “Automatic recognition of music score (in Japanese).” <i>Bit (special issue on Computer and Music)</i>, 92–100."
    ],
    "1986": [
        "Roads, Curtis. 1986. “The Tsukuba Musical Robot.” <i>Computer Music Journal</i> 10 (2):39–43.",
        "Tonnesland, S. 1986. <i>Symfoni: System for note coding (in Norwegian)</i>. Institute of Informatics, Oslo, Norway."
    ],
    "1985": [
        "Fujimoto, Yoichi. 1985. “The Keyboard Playing Robot WABOT-2.” <i>Bulletin of Science and Engineering Research Laboratory</i> 112.",
        "Lee, Myung Woo, and Jong Soo Choi. 1985. “The Recognition of Printed Music Score and Performance Using Computer Vision System (in Korean and English Translation).” <i>Journal of the Korean Institute of Electronic Engineers</i> 22 (5):429–35.",
        "Matsushima, Toshiaki, Itaru Sonomoto, Tadanori Harada, Katsuhiro Kanamori, and Sadamu Ohteru. 1985. “Automated High Speed Recognition of Printed Music (WABOT-2 Vision System).” In <i>Proceedings of the 1985 International Conference on Advanced Robotics</i>, 477–82.",
        "Matsushima, Toshiaki, Sadamu Ohteru, and Katsuhiro Kanamori. 1985. “Automatic Recognition of Printed Music (in Japanese).” <i>Japan Acoustics Society Journal</i> 41 (6):412–15.",
        "Matsushima, Toshiaki, Tadanori Harada, Itaru Sonomoto, Katsuhiro Kanamori, Akio Uesugi, Yuji Nimura, Shuji Hashimoto, and Sadamu Ohteru. 1985. “Automated Recognition System for Musical Score: The Vision System of WABOT-2.” <i>Bulletin of Science and Engineering Research Laboratory</i> 112:25–52.",
        "Sonomoto, Itaru, Tadanori Harada, Toshiaki Matsushima, Katsuhiro Kanamori, M. Konuma, Akio Uesugi, Yuji Nimura, Shuji Hashimoto, and Sadamu Ohteru. 1985. “Automated Recognition System of Printed Music for Playing Keyboards (in Japanese).” <i>Acoustical Society of Japan</i> 84 (22):17–22."
    ],
    "1984": [
        "Ohteru Sadamu. 1984. “A multi processor system for high speed recognition of printed music (in Japanese).” In <i>National Convention Records of IECE</i>."
    ],
    "1983": [
        "Maenaka, Karl, and Tadokoro Yoshiaki. 1983. “Recognition of Music Using the Special Image-Input-Device Enabling to Scan the Staff of Music as the Supporting System for the Blind (in Japanese).” <i>Prl83-60</i>, 37–45."
    ],
    "1982": [
        "Andronico, Alfio, and Alberto Ciampa. 1982. “On Automatic Pattern Recognition and Acquisition of Printed Music.” In <i>Proceedings of the International Computer Music Conference</i>, 245–78.",
        "Aoyama, Hiroshi, and A. Tojo. 1982a. “Automatic Recognition of Music Score (in Japanese).” In <i>Electronic Image Conference Journal</i>, 11:427–35. 5.",
        "Aoyama, Hiroshi, and A. Tojo. 1982b. “Automatic Recognition of Printed Music (in Japanese).” In <i>Institute of Electronics and Communications Engineers of Japan (IECE)</i>, 33–40.",
        "Mahoney, James Victor. 1982. <i>Automatic Analysis of Musical Score Images</i>. Massachusetts Institute of Technology.",
        "Tojo, A., and Hiroshi Aoyama. 1982. “Automatic Recognition of Music Score.” In <i>Sixth International Conference on Pattern Recognition</i>. Vol. 1223."
    ],
    "1979": [
        "Onoe Morio, Ishizuka Mitsuru, and Tsuboi Kuniaki. 1979. “Experiment on automatic music reading (in Japanese).” In <i>Proceedings of the 20th IPSJ National Conference</i>, 6–65."
    ],
    "1978": [
        "Fischer, K.N. 1978. <i>Computer Recognition of Engraved Music</i>. University of Tennessee.",
        "Nakamura, Y., M. Shindo, and Seiji Inokuchi. 1978. “Input Method of [Musical] Note and Realization of Folk Music Data-Base (in Japanese).” In <i>Institute of Electronics and Communications Engineers of Japan (IECE)</i>, 78:41–50. 73.",
        "Wittlich, Gary, Donald Byrd, and Rosalee Nerheim. 1978. “A system for interactive encoding of music scores under computer control.” <i>Computers and the Humanities</i> 12 (4):309–19."
    ],
    "1975": [
        "Prerau, David Stewart. 1975. “Do-Re-Mi: A Program That Recognizes Music Notation.” <i>Computer and the Humanities</i> 9 (1):25–29."
    ],
    "1974": [
        "Wittlich, Gary E. 1974. <i>Non-physics measurements on the PEPR system: Seismograms and music scores</i>."
    ],
    "1973": [
        "Nelson, Gary, and Terry R. Penney. 1973. “Pattern Recognition in Musical Score - Project No. M88.” In <i>Computers and the Humanities</i>, 8:50–51.",
        "Wittlich, Gary. 1973. “Project Score.” <i>Computational Musicology Newsletter</i> 1 (1):6."
    ],
    "1972": [
        "Kassler, Michael. 1972. “Optical Character Recognition of Printed Music: A Review of Two Dissertations.” <i>Perspectives of New Music</i> 11:250–54."
    ],
    "1971": [
        "Prerau, David. 1971. “Computer Pattern Recognition of Printed Music.” <i>AFIP Joint Computer Conferences</i> 39:153–62."
    ],
    "1970": [
        "Kassler, Michael. 1970. “An Essay toward Specification of a Music-Reading Machine.” In <i>Musicology and the Computer</i>, edited by Barry Brook, 151–75. New York: City University of New York Press."
    ],
    "1966": [
        "Pruslin, Dennis. 1966. “Automatic Recognition of Sheet Music.” Massachusetts Institute of Technology."
    ]
}