{
    "2025": [
        "Fujinaga, Ichiro, Junjun Cao, Kyrie Bouressa, Hanwen Zhang, Kun Fang, Liam Pond, Yu-Chia Kuo, et al. 2025. “Integrating Music Databases with Linked Data.” Daejeon, Korea.",
        "Kun Fang, Kyrie Bouressa, Yu-Chia Kuo, Anna de Bakker, and Ichiro Fujinaga. 2025. “Universal Musical Instrument Lexicon: A Crowdsourced Platform for Expanding Multilingual Vocabularies and Enhancing Global Access to Musical Instrument Metadata.” Presented at the Accepted by the 12th International Conference on Digital Libraries for Musicology, Sogang University, Seoul, South Korea.",
        "Pond, Liam, Linnea Kirby, Sichen Meng, Simon Ngassam, Sebastien Chow, Dylan Hillerbrand, and Ichiro Fujinaga. 2025. “SESEMMI for LinkedMusic: Democratizing Access to Musical Archives via Large Language Models.” Daejeon, South Korea. <a href=\"https://m-a-p.ai/LLM4Music/papers/LLM4MA_Poster%20-%20Liam%20Pond.pdf\">https://m-a-p.ai/LLM4Music/papers/LLM4MA_Poster%20-%20Liam%20Pond.pdf</a>."
    ],
    "2019": [
        "Hopkins, Emily, Yaolong Ju, Gustavo Polins Pedro, Cory McKay, Julie Cumming, and Ichiro Fujinaga. 2019. “SIMSSA DB: Symbolic Music Discovery and Search.” Poster presented at the 6th International Conference on Digital Libraries for Musicology, Den Haag, Netherlands, November 9.",
        "Ju, Yaolong. 2019. “An Interactive Workflow for Generating Chord Labels for Homorhythmic Music in Symbolic Formats.” Poster presented at the 20th International Society of Music Information Retrieval Conference, Delft, Netherlands, November 8. <a href=\"http://cloud.simssa.ca/index.php/f/996\">http://cloud.simssa.ca/index.php/f/996</a>.",
        "Nápoles, Néstor López, Gabriel Vigliensoni, and Ichiro Fujinaga. 2019. “The Effects of Translation between Symbolic Music Formats: A Case Study with Humdrum, Lilypond, MEI, and MusicXML.” Poster presented at the annual Music Encoding Conference, Vienna, Austria, June 29.",
        "Reuse, Tim de, and Ichiro Fujinaga. 2019. “CopyForward: Point-Set Matching for Predicting Patterns.” Poster presented at the 15th running of the Music Information Retrieval Evaluation eXchange at the 20th International Society for Music Information retrieval Conference, Delft, Netherlands, November 4."
    ],
    "2018": [
        "Nápoles, Néstor, Claire Arthur, and Ichiro Fujinaga. 2018. “Symbolic and Audio Key Detection Based on a Hidden Markov Model.” Poster presented at the 19th International Society for Music Information Retrieval Conference, Paris, France, September 23."
    ],
    "2017": [
        "Ju, Yaolong, Nathaniel Condit-Schultz, Claire Arthur, and Ichiro Fujinaga. 2017. “Non-Chord Tone Identification Using Deep Neural Networks.” Poster presented at the 18th International Society for Music Information Retrieval Conference (Late-Breaking), Suzhou, China, October 23.",
        "McKay, Cory, Andrew Hankinson, Julie Cumming, and Ichiro Fujinaga. 2017. “A Database Model for Computational Music Research.” Poster presented at the 4th International Workshop on Digital Libraries for Musicology, Suzhou, China, October 28.",
        "McKay, Cory, Julie Cumming, and Ichiro Fujinaga. 2017. “Characterizing Composers Using JSymbolic2 Features.” Poster presented at the 18th International Society for Music Information Retrieval Conference, Suzhou, China, August 7.",
        "Parmentier, Alex, Andrew Hankinson, and Ichiro Fujinaga. 2017. “Tripoli: Presentation API Validation.” Poster presented at the International Image Interoperability Framework Annual Conference, The Vatican, Italy, June 7.",
        "Vigliensoni, Gabriel, Jorge Calvo-Zaragoza, and Ichiro Fujinaga. 2017. “Reconnaissance Optique de La Musique Basée Sur l’Apprentissage Machine à Grande Échelle Pour Des Données de Partitions Musicales.” Poster presented at the 85e édition du Congrès de l’Association francophone pour le savoir, Montreal, Canada, May 8."
    ],
    "2016": [
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2016. “Staff Line Detection on Grewscale Images with Pixel Classification.” Poster presented at the 17th International Society for Music Information Retrieval Conference, New York City, USA, August 7.",
        "Horwitz, Andrew, Andrew Hankinson, and Ichiro Fujinaga. 2016. “An MEI Score Alignment Client.” Poster presented at the annual Music Encoding Conference, Montreal, Canada, May 17.",
        "McKay, Cory, Tristano Tenaglia, and Ichiro Fujinaga. 2016. “JSymbolic2: Extracting Features from Symbolic Music Representations.” Poster presented at the 17th International Society for Music Information Retrieval Conference, New York City, USA, August 7.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2016. “Automatic Music Recommendation Systems: Do Demographic, Profiling, and Contextual Features Improve Their Performance?” Poster presented at the 17th International Society for Music Information Retrieval Conference, New York City, USA, August 7.",
        "Weiss, Susan Forscher, and Ichiro Fujinaga. 2016. “The Human History Project: Digital Prosopography of Renaissance Musicians.” Poster presented at the 3rd International Digital Libraries for Musicology workshop, New York City, USA, August 12."
    ],
    "2015": [
        "Fogarty, Alex, Andrew Hankinson, and Ichiro Fujinaga. 2015. “A Browser-Based Neume Metadata Editor.” Poster presented at the annual Muic Encoding Conference, Florence, Italy, May 18.",
        "Horwitz, Andrew, Andrew Hankinson, and Ichiro Fujinaga. 2015. “A Browser-Based MEI Editor.” Poster presented at the annual Muic Encoding Conference, Florence, Italy, May 18."
    ],
    "2014": [
        "Antila, Christopher, and Julie Cumming. 2014. “The VIS Framework: Analyzing Counterpoint in Large Datasets.” Poster presented at the 15th International Society for Music Information Retrieval Conference, Taipei, Taiwan, October 27.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2014a. “Identifying Time Zones in a Large Dataset of Music Listening Logs.” Poster presented at the 1st International Workshop on Social Media Retrieval and Analysis, Gold Coast, Australia, July 11.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2014b. “Time-Shift Normalization and Listener Profiling in a Large Dataset of Music Listening Histories.” Poster presented at the 4th annual seminar on cognitively based music informatics research, Toronto, Canada, October 4.",
        "Weiss, Susan Forscher, and Ichiro Fujinaga. 2014. “Digital Prosopography of Renaissance Musicians: Discovery of Social and Professional Networks.” Poster presented at the 8th Annual Meeting of the American Musicological Society and the 37th Annual Meeting of the Society for music Theory, Milwaukee, USA, November 6."
    ],
    "2013": [
        "Burlet, Gregory, Marcelo M. Wanderley, and Ichiro Fujinaga. 2013. “Stompboxes: Kicking the Habit.” Poster presented at the 13th International Conference on New Interfaces for Musical Expression, Daejeon, Republic of Korea, May 27.",
        "Groves, Ryan, Doina Precup, and Ichiro Fujinaga. 2013. “Automatic Rock’n’Roll Accompaniment: Using a Hidden Semi-Markov Model.” Poster presented at the 4th International Conference on Mathematics and Computation in Music, Montreal, Canada, June 12.",
        "Vigliensoni, Gabriel, Gregory Burlet, and Ichiro Fujinaga. 2013. “Optical Measure Recognition in Common Music Notation.” Poster presented at the 14th International Society for Music Information Retrieval Conference, Curitiba, Brazil, November 4.",
        "Vigliensoni, Gabriel, John Ashley Burgoyne, and Ichiro Fujinaga. 2013. “Musicbrainz for the World: The Chilean Experience.” Poster presented at the 14th International Society for Music Information Retrieval Conference, Miami, USA, November 4."
    ],
    "2012": [
        "Burlet, Gregory, Alastair Porter, Andrew Hankinson, and Ichiro Fujinaga. 2012. “Neon.Js: Neume Editor Online.” Poster presented at the 13th International Society for Music Information Retrieval Conference, Porto, Portugal, October 8.",
        "Hankinson, Andrew, Gabriel Vigliensoni, John Ashley Burgoyne, and Ichiro Fujinaga. 2012. “New Tools for Optical Chant Recognition.” Poster presented at the Music Libraries Association 81st Annual Meeting, Dallas, USA, February 15."
    ],
    "2011": [
        "Burlet, Gregory, and Ichiro Fujinaga. 2011. “Robotaba Guitar Tablature Transcription Framework.” Poster presented at the 12th International Society for Music Information Retrieval Conference, Miami, USA, October 24.",
        "Hankinson, Andrew, Daniel Donnelly, Ichiro Fujinaga, and Julie Cumming. 2011. “An Annotated Dataset for Optical Music Recognition Systems Development.” Poster presented at the Center for Interdisciplanary Research in Music Media and Technology (CIRMMT) Student Symposium, Montreal, Canada, May 16.",
        "Hankinson, Andrew, Gabriel Vigliensoni, John Ashley Burgoyne, and Ichiro Fujinaga. 2011. “New Tools for Optical Chant Recognition.” Poster presented at the annual International Association of Music Libraries, Archives and Documentation Centres Congress, Dublin, Ireland, July 24.",
        "Hockman, Jason A., David M. Weigh, Catherine Guastavino, and Ichiro Fujinaga. 2011. “Discrimination between Phonograph Playback Ystems.” Poster presented at the 131th Audio Engineering Society Convention, New York City, USA, October 20.",
        "Knight, Trevor, Finn Upham, and Ichiro Fujinaga. 2011. “The Potential for Automatic Assessment of Trumpet Tone Quality.” Poster presented at the 12th International Society for Music Information Retrieval Conference, Miami, USA, October 24.",
        "Neubarth, Kerstin, Mathieu Bergeron, and Darrell Conklin. 2011. “Associations between Musicology and Music Information Retrieval.” Poster presented at the 12th International Society for Music Information Retrieval Conference, Miami, USA, October 24.",
        "Smith, Jordan B. L., John Ashley Burgoyne, Ichiro Fujinaga, David de Roure, and J. Stephen Downie. 2011. “Design and Creation of a Large-Scale Database of Structural Annotations.” Poster presented at the 12th International Society for Music Information Retrieval Conference, Miami, USA, October 24.",
        "Thompson, Jessica, Andrew Hankinson, and Ichiro Fujinaga. 2011. “Searching for the Liber Usualis: Using CouchDB and ElasticSearch to Query Graphical Music Documents.” Poster presented at the 12th International Society for Music Information Retrieval Conference, Miami, USA, October 24.",
        "Vigliensoni, Gabriel, John Ashley Burgoyne, Andrew Hankinson, and Ichiro Fujinaga. 2011. “Automatic Pitch Recognition in Printed Square-Note Notation.” Poster presented at the 12th International Society for Music Information Retrieval Conference, Miami, USA, October 24."
    ],
    "2010": [
        "Angeles, Bruno, Cory McKay, and Ichiro Fujinaga. 2010. “Discovering Metadata Inconsistencies.” Poster presented at the 11th International Society for Music Information Retrieval Conference, Utrecht, Netherlands, August 9.",
        "Burgoyne, John Ashley, and Ichiro Fujinaga. 2010. “Smart Statistical Models for Musical Data.” Poster presented at the annual meeting of the Society for Music Theory, Indianapolis, USA, November 4.",
        "Conklin, Darrell, and Mathieu Bergeron. 2010. “Discovery of Contrapuntal Patterns.” Poster presented at the 11th International Society for Music Information Retrieval Conference, Utrecht, Netherlands, August 9.",
        "Devaney, Johanna, and Ichiro Fujinaga. 2010. “AMPACT: Automated Music Performance Analysis and Comparison Toolkit.” Poster.",
        "Hankinson, Andrew, Laurent Pugin, and Ichiro Fujinaga. 2010. “An Interchange FOrmat for Optical Music Recognition Applications.” Poster presented at the 11th International Society for Music Information Retrieval Conference, Utrecht, Netherlands, August 9.",
        "Hockman, Jason A., Jason Malloch, Ichiro Fujinaga, and Marcelo M. Wanderley. 2010. “Interactive Real-Time Rhythmic.” Poster presented at the Center for Interdisciplinary Research in Music Media and Technology (CIRMMT) Student Symposium, Montreal, QC, May 27.",
        "Hockman, Jason A., and Ichiro Fujinaga. 2010. “Fast vs Slow: Learning Tempo Ocataves from User Data.” Poster presented at the 11th International Society for Music Information Retrieval Conference, Utrecht, Netherlands, August 9.",
        "McKay, Cory, John Ashley Burgoyne, Jason Hockman, Jordan B. L. Smith, Gabriel Vigliensoni, and Ichiro Fujinaga. 2010. “Evaluating the Genre Classification Performance of Lyrical Features Relative to Audio, Symbolic and Cultural Features.” Utrecht, Netherlands, August 9.",
        "Vigliensoni, Gabriel, Cory McKay, and Ichiro Fujinaga. 2010. “Using JWebMiner 2.0 to Improve Music Classification Performance by Combining Different Types of Features Mined from the Web.” Poster presented at the 10th International Society for Music Information Retrieval Conference, Utrecht, Netherlands, August 9."
    ],
    "2009": [
        "Devaney, Johanna, Jonathan Wild, Ichiro Fujinaga, and Douglas Elk. 2009. “Intonation Tendencies in Sola A Cappella Vocal Performances.” Poster presented at the 2009 Biennial Meeting of the Society for Music Perception and Cognition, Indianapolis, USA, August 3.",
        "Hockman, Jason A., Marcelo M. Wanderley, and Ichiro Fujinaga. 2009. “Automated Phase Vocoder.” Poster presented at the 9th New Interfaces for Musical Expression International Conference, Pittsburgh, USA, June 4.",
        "Li, Beinan, Jordan B. L. Smith, and Ichiro Fujinaga. 2009. “Optical Audio Reconstruction for Stereo Phonograph Records Using White-Light Interferometry.” Poster presented at the 10th International Society for Music Information Retrieval Conference, Kobe, Japan, October 26.",
        "McKay, Cory, and Ichiro Fujinaga. 2009. “JMir: Tools for Automatic Music Classification.” Poster presented at the 2009 International Computer Music Conference, Montreal, Canada, August 16.",
        "Ouyang, Yue, John Ashley Burgoyne, Laurent Pugin, and Ichiro Fujinaga. 2009. “A Robust Border Detection Algorithm with Application to Medieval Music Manuscripts.” Poster presented at the 2009 International Computer Music Conference, Montreal, Canada, August 16.",
        "Thompson, Jessica, Cory McKay, John Ashley Burgoyne, and Ichiro Fujinaga. 2009. “Additions and Improvements to the ACE 2.0 Music Classifier.” Poster presented at the 10th International Society for Music Information Retrieval Conference, Kobe, Japan, October 26."
    ],
    "2008": [
        "Burgoyne, John Ashley, Johanna Devaney, Laurent Pugin, and Ichiro Fujinaga. 2008. “Enhanced Bleedthrough Correction for Early Music Document with Recto-Verso Registration.” Poster presented at the 9th International Conference on Music Information Retrieval, Philadelphia, USA, September 14.",
        "Devaney, Johanna, and Ichiro Fujinaga. 2008. “Assessing the Role of Sensory Consonance in Trained Musicians’ Tuning Preferences.” Poster presented at the 10th International Conference on Music Perception and Cognition, Sapporo, Japan, August 25.",
        "Hankinson, Andrew, Laurent Pugin, Gabriella Hanke Knaus, and Ichiro Fujinaga. 2008. “A Web-Based Musical Document Viewer for Digital Music Library.” Poster (late-breaking) presented at the Conference of the International Society for Music Information Retrieval, Philadelphia, PA.",
        "Hockman, Jason A., Matthew E.P. Davies, Juan P. Bello, and Mark D. Plumbley. 2008. “Automated Rhythmic Transformation of Musical Audio.” Poster presented at the 11th International Conference on Digital Audio Effects, Espoo, Finland, September 1.",
        "Pugin, Laurent, Jason Hockman, John Ashley Burgoyne, and Ichiro Fujinaga. 2008. “Gamera versus Aruspix: Two Optical Music Recognition Approaches.” Poster presented at the 9th International Society for Music Information Retrieval Conference, Philadelphia, USA, September 14.",
        "Pugin, Laurent, John Ashley Burgoyne, and Ichiro Fujinaga. 2008. “Optical Music Recognition to Digitise Early Music Collections on a Library Scale.” Poster presented at the annual International Association of Music Libraries, Archives and Documentation Centres Congress, Naples, Italy, July 20."
    ],
    "2007": [
        "Lai, Catherine, Ichiro Fujinaga, David Descheneau, Michael Frishkopf, Jenn Riley, Joseph Hafner, and Brian McMillan. 2007. “Metadata Infrastructure for Sound Recordings.” Poster presented at the 8th International Conference on Music Information Retrieval, Vienna, Austria, September 23.",
        "Li, Beinan, Simon de Leon, and Ichiro Fujinaga. 2007. “Alternative Digitization Approach for Stereo Phonograph Records Using Optical Audio Reconstruction.” Poster presented at the 8th International Society for Music Information Retrieval Conference, Vienna, Austria, September 23.",
        "McKay, Cory, and Ichiro Fujinaga. 2007. “JWebMiner: A Web-Based Feature Extractor.” Poster presented at the 8th International Conference on Music Information Retrieval, Vienna, Austria, September 23."
    ],
    "2006": [
        "Fujinaga, Ichiro, and Daniel McEnnis. 2006. “On-Demand Metadata Extraction Network [OMEN]: Making Libraries’ Music Collections Available to MIR Researchers for Search and Analysis.” Poster presented at the 6th ACM/IEEE-CS joint conference on Digital libraries, New York City, USA, June 11.",
        "Lai, Catherine, and Ichiro Fujinaga. 2006. “A Metadata Data Dictionary for Analog Sound and Recordings.” Poster presented at the 6th ACM/IEEE-CS joint conference on Digital libraries, Chapel Hill, USA, June 11.",
        "Li, Beinan, Catherine Lai, and Ichiro Fujinaga. 2006a. “Technical Issues in Digitization of Large Online Collections of Phonograph Records.” Poster presented at the 3rd IS&amp;T Archiving Conference, Ottawa, Canada, May 23.",
        "Li, Beinan, Catherine Lai, and Ichiro Fujinaga. 2006b. “Technical Issues in Digitization of Large Online Collections of Phonograph Records - Part 2.” Poster presented at the 3rd IS&amp;T Archiving Conference, Ottawa, Canada, May 23.",
        "Li, Beinan, Ichiro Fujinaga, and Cory McKay. 2006. “Automatic Track Segmentation for Digitized Phonograph Records.” Poster, May.",
        "Li, Beinan, John Ashley Burgoyne, and Ichiro Fujinaga. 2006. “Extending Audacity for Audio Annotation.” Poster presented at the 7th International Society for Music Information Retrieval Conference, Victoria, Canada, October 8.",
        "McEnnis, Daniel, Cory McKay, and Ichiro Fujinaga. 2006. “JAudio: Additions and Improvements.” Poster presented at the 7th International Conference on Music Information Retrieval, Victoria, Canada, October 8.",
        "McKay, Cory, and Ichiro Fujinaga. 2006. “Combining Features Extracted from Audio, Symbolic and Cultural Sources.” Poster presented at the 8th International Conference on Music Information Retrieval, Vienna, Austria, June 11.",
        "Sinclair, Stephen, Michael Droettboom, and Ichiro Fujinaga. 2006. “Lilypond for PyScore: Approaching a Universal Translator for Music Notation.” Poster presented at the 7th International Conference on Music Information Retrieval, Victoria, Canada, October 8."
    ],
    "2005": [
        "Burgoyne, John Ashley, and Lawrence K. Saul. 2005. “Learning Harmonic Relationships in Digital Audio with Dirichlet-Based Hidden Markov Models.” Poster presented at the 6th International Conference on Music Information Retrieval, London, UK, September 11.",
        "Fiebrink, Rebecca, Cory McKay, and Ichiro Fujinaga. 2005. “Combining D2K and JGAP for Efficient Feature Weighting for Classification Tasks in Music Information Retrieval.” Poster, London, UK, September 11.",
        "Lai, Catherine, Beinan Li, and Ichiro Fujinaga. 2005. “Preservation Digitizaation of David Edelberg’s Handel LP Collection: A Pilot Project.” Poster presented at the 6th International Conference on Music Information Retrieval, London, UK, September 11.",
        "Lai, Catherine, Ichiro Fujinaga, and Cynthia A. Leive. 2005. “MetaData for Phonograph Records: Facilitating New Forms of Use and Access to Analogue Recordings.” Poster presented at the 5th ACM/IEEE-CS joint conference on Digital libraries, Denver, USA, June 7.",
        "McEnnis, Daniel, Cory McKay, Ichiro Fujinaga, and Philippe Depalle. 2005. “JAudio: A Feature Extraction Library.” Posrer presented at the 6th International Conference on Music Information Retrieval, London, UK, September 11.",
        "Sinyor, Elliot, Cory McKay, Rebecca Fiebrink, Daniel McEnnis, and Ichiro Fujinaga. 2005. “Beatbox Classification Using ACE.” Poster presented at the 6th International Conference on Music Information Retrieval, London, UK, September 11."
    ]
}
