{
    "2025": [
        "Burt, Lauren A, Liam T Pond, Annabel R Bugbird, David A Hanley, and Steven K Boyd. 2025. “Canadian Adult Reference Data for Body Composition, Trabecular Bone Score and Advanced Hip Analysis Using DXA.” <i>Journal of Clinical Densitometry</i> 28 (1): 101535.",
        "Kun Fang, Hanwen Zhang, Wang Ziyu, and Ichiro Fujinaga. 2025. “High Resolution Sustain Pedal Depth Estimation from Piano Audio across Room Acoustics.” <i>Accepted by 26th International Society for Music Information Retrieval Conference</i> (Daejeon, South Korea and Online).",
        "Pond, Liam, and Ichiro Fujinaga. 2025. “Teaching LLMs Music Theory with In-Context Learning and Chain-of-Thought Prompting: Pedagogical Strategies for Machines.” In <i>Proceedings of the 17th International Conference on Computer Supported Education – Volume 1: CSME</i> 1: 671–81. <a href=\"https://doi.org/10.5220/0013506100003932\">https://doi.org/10.5220/0013506100003932</a>.",
        "Saini, Vinay, Liam Pond, Jackson Uhryn, et al. 2025. “Shear-Dependent Tribological Behavior of Oleic Acid as a Sustainable Lubricant Additive in Oils and Nano-Greases.” <i>Wear</i>, 205932."
    ],
    "2024": [
        "Abid, Noor, Liam Pond, and Svetlana Yanushkevich. 2024. “Causality Exploration in Modeling Engineering Student Satisfaction.” <i>2024 IEEE Global Engineering Education Conference (EDUCON)</i>, 1–10.",
        "Anzum, Fahim, Ashratuz Zavin Asha, Lily Dey, et al. 2024. “A Comprehensive Review of Trustworthy, Ethical, and Explainable Computer Vision Advancements in Online Social Media.” <i>Global Perspectives on the Applications of Computer Vision in Cybersecurity</i>, 1–46.",
        "Bain, Jennifer, and Anna de Bakker. 2024. “Traces of Liturgy: Analysing Manuscript Fragments from the Binding of the Riesencodex.” <i>Fragmentology</i> 7: 9–51.",
        "Bouressa, Kyrie Ekaterina and Ichiro Fujinaga. 2024. “Musical Instrument Encoding Matters.” In <i>Proceedings of the Music Encoding Conference.</i> (Denton, TX). <a href=\"https://doi.org/10.17613/g587-jh48\">https://doi.org/10.17613/g587-jh48</a>.",
        "Fang, Kun, Ziyu Wang, Gus Xia, and Ichiro Fujinaga. 2024. “Exploring Gpt’s Ability as a Judge in Music Understanding.” In <i>Proceedings of the 25th International Society for Music Information Retrieval Conference</i>, 996–1003. <a href=\"https://doi.org/10.5281/zenodo.14877499\">https://doi.org/10.5281/zenodo.14877499</a>.",
        "Geneviève Gates-Panneton. 2024. “Salzinnes and Digital Tools.” <i>Journal of the Alamire Foundation, Forthcoming</i>.",
        "Ichiro Fujinaga, Anna de Bakker, Andrew Hankinson, Dylan Hillerbrand, and Laurent Pugin. 2024a. “Using Optical Music Recognition in Search of Early European Music.” <i>Actes Des Journées d’Informatique Musicale</i>, 257–63. <a href=\"https://cloud.prism.cnrs.fr/index.php/s/8aX4YaDXArst2xQ\">https://cloud.prism.cnrs.fr/index.php/s/8aX4YaDXArst2xQ</a>.",
        "Ichiro Fujinaga, Anna de Bakker, Andrew Hankinson, Dylan Hillerbrand, and Laurent Pugin. 2024b. “LinkedNeumes: The Making of Cantus Ultimus.” Paper presented at Annual Medieval and Renaissance Music Conference, Granada, Spain. July.",
        "Shaojun Si. 2024. “A Review of the New Ideas and Methods of Music Communication in the New Media Era.” <i>Chinese Music</i> 6."
    ],
    "2023": [
        "Acquilino, Alberto, Ninad Puranik, Ichiro Fujinaga, and Gary P Scavone. 2023b. “A Dataset and Baseline for Automated Assessment of Timbre Quality in Trumpet Sound.” In <i>Proceedings of the International Society for Music Information Retrieval Conference,</i> (Milan, Italy), 684–91.",
        "Acquilino, Alberto, Ninad Puranik, Ichiro Fujinaga, and Gary Scavone. 2023a. “Detecting Efficiency in Trumpet Sound Production: Proposed Methodology and Pedagogical Implications.” In <i>Proceedings of the Stockholm Music Acoustics Conference</i> (Stockholm, Sweden), 72–79.",
        "Castellanos, Francisco J, Antonio Javier Gallego, and Ichiro Fujinaga. 2023a. “A Few-Shot Neural Approach for Layout Analysis of Music Score Images.” In <i>Proceedings of the International Society for Music Information Retrieval Conference, 684–91. Milan, Italy.</i> (Milan, Italy), 106–13.",
        "Castellanos, Francisco J, Antonio Javier Gallego, and Ichiro Fujinaga. 2023b. “A Preliminary Study of Few-Shot Learning for Layout Analysis of Music Scores.” In <i>Proceedings of the 5th International Workshop on Reading Music Systems</i>, edited by Jorge Calvo-Zaragoza, Alexander Pacha, and Elona Shatri. Milan, Italy. <a href=\"https://doi.org/10.48550/arXiv.2311.04091\">https://doi.org/10.48550/arXiv.2311.04091</a>.",
        "Fujinaga, Ichiro, and Gabriel Vigliensoni. 2023. “Optical Music Recognition Workflow for Medieval Music Manuscripts.” In <i>Proceedings of the 5th International Workshop on Reading Music Systems</i>, edited by Jorge Calvo-Zaragoza, Alexander Pacha, and Elona Shatri. Milan, Italy. <a href=\"https://doi.org/10.48550/arXiv.2311.04091\">https://doi.org/10.48550/arXiv.2311.04091</a>.",
        "McKay, Cory, Julie Cumming, and Ichiro Fujinaga. 2023. “Rhythmic, Melodic and Vertical N-Gram Features as a Means of Studying Symbolic Music Computationally.” In <i>Annual International Conference of the Alliance of Digital Humanities</i>, edited by Anne Baillot, Toma Tasovac, Walter Scholger, and Georg Vogeler. Graz, Austria. <a href=\"https://doi.org/10.5281/ZENODO.8107739\">https://doi.org/10.5281/ZENODO.8107739</a>."
    ],
    "2022": [
        "De Reuse, Timothy, and Ichiro Fujinaga. 2022. “A Transformer-Based\" Spellchecker\" for Detecting Errors in OMR Output.” In <i>Proceedings of the  International Society for Music Information Retrieval Conference</i> (Bangaluru, India), 789–96.",
        "Thomae, Martha E, Julie Cumming, and Ichiro Fujinaga. 2022. “Counterpoint Error-Detection Tools for Optical Music Recognition of Renaissance Polyphonic Music.” In <i>Proceedings of the 23rd International Society for Music Information Retrieval Conference</i> (Bangalulu, India), 501–8."
    ],
    "2021": [
        "Cumming, Julie, Cory McKay, Peter Schubert, Néstor Nápoles López, and Sylvain Margot. 2021. “Contrapuntal Style: Pierre de La Rue vs. Josquin Des Prez.” In <i>Pierre de La Rue Studies</i>, edited by David Burn and Honey Meconi.",
        "Cumming, Julie, and Cory McKay. 2021. “Using Corpus Studies to Find the Origins of the Madrigal.” In <i>Proceedings of the Conference Future Directions of Music Cognition</i>. The Ohio State University, Columbus, US (virtual).",
        "Hanssian, Sevag. 2021. “Music Demixing with the SliCQ Transform.” In <i>Proceedings of the MDX Workshop</i>. <a href=\"https://arxiv.org/abs/2112.05509v1\">https://arxiv.org/abs/2112.05509v1</a>.",
        "Thomae, Martha E. 2021. “The Guatemalan Choirbooks: Facilitating Preservation, Performance, and Study of the Colonial Repertoire.” In <i>Christian Music Traditions in the Americas</i>, edited by Andrew Shenton and Joanna Smolko. New York: Rowman &amp; Littlefield."
    ],
    "2020": [
        "Daigle, Alexandre. 2020. “Evaluation of Optical Music Recognition Software.” Master’s Thesis, Montreal, QC: McGill University.",
        "Desmond, Karen, Andrew Hankinson, Laurent Pugin, Juliette Regimbal, Craig Sapp, and Martha E. Thomae. 2020. “Next Steps for Measuring Polyphony–A Prototype Editor for Encoding Mensural Music.” In <i>Music Encoding Conference Proceedings 26-29 May, 2020</i>, 121–24. Tufts University, Boston. <a href=\"http://dx.doi.org/10.17613/5k88-9z02\">http://dx.doi.org/10.17613/5k88-9z02</a>.",
        "Desmond, Karen, Emily Hopkins, Samuel Howes, and Julie E. Cumming. 2020. “Computer-Aided Analysis of Sonority in the French Motet Repertory, c. 1300-1350.” <i>Music Theory Online</i> 26 (4):26.4.2.",
        "Ju, Yaolong, Sylvain Margot, Cory McKay, Luke Dahn, and Ichiro Fujinaga. 2020. “Automatic Figured Bass Annotation Using the New Bach Chorales Figured Bass Dataset.” In <i>Proceedings of the International Society for Music Information Retrieval Conference</i>, 640–46.",
        "Ju, Yaolong, Sylvain Margot, Cory McKay, and Ichiro Fujinaga. 2020a. “Automatic Chord Labelling: A Figured Bass Approach.” In <i>7th International Conference on Digital Libraries for Musicology</i>, 27–31. DLfM 2020. New York, NY: Association for Computing Machinery. <a href=\"https://doi.org/10.1145/3424911.3425513\">https://doi.org/10.1145/3424911.3425513</a>.",
        "Ju, Yaolong, Sylvain Margot, Cory McKay, and Ichiro Fujinaga. 2020b. “Figured Bass Encodings for Bach Chorales in Various Symbolic Formats: A Case Study.” In <i>Music Encoding Conference Proceedings 26-29 May, 2020</i>, 71–73. Tufts University, Boston. <a href=\"https://hcommons.org/deposits/item/hc:31943\">https://hcommons.org/deposits/item/hc:31943</a>.",
        "Nápoles López, Néstor, Laurent Feisthauer, Florence Levé, and Ichiro Fujinaga. 2020. “On Local Keys, Modulations, and Tonicizations: A Dataset and Methodology for Evaluating Changes of Key.” In <i>International Conference on Digital Libraries for Musicology</i>, 18–26. Montréal, QC: Association for Computing Machinery. <a href=\"https://doi.org/10.1145/3424911.3425515\">https://doi.org/10.1145/3424911.3425515</a>.",
        "Nápoles López, Néstor, and Ichiro Fujinaga. 2020. “Harmalysis: A Language for the Annotation of Roman Numerals in Symbolic Music Representations.” In <i>Music Encoding Conference Proceedings 26-29 May, 2020</i>, 83–85. Tufts University, Boston. <a href=\"https://hcommons.org/deposits/item/hc:31951\">https://hcommons.org/deposits/item/hc:31951</a>.",
        "Regimbal, Juliette, Gabriel Vigliensoni, Caitlin Hutnyk, and Ichiro Fujinaga. 2020. “IIIF-Based Lyric and Neume Editor for Square-Notation Manuscripts.” In <i>Music Encoding Conference Proceedings 26-29 May, 2020</i>, 15–18. Tufts University, Boston. <a href=\"http://dx.doi.org/10.17613/d41w-n008\">http://dx.doi.org/10.17613/d41w-n008</a>.",
        "Tardón, Lorenzo J., Isabel Barbancho, Ana M. Barbancho, and Ichiro Fujinaga. 2020. “Automatic Staff Reconstruction within SIMSSA Project.” <i>Applied Sciences</i> 10:2468.",
        "Thomae, Martha E., Antonio Ríos-Vila, Jorge Calvo-Zaragoza, David Rizo, and Jose M. Iñesta. 2020. “Retrieving Music Semantics from Optical Music Recognition by Machine Translation.” In <i>Music Encoding Conference Proceedings 26-29 May, 2020</i>, 19–24. Tufts University, Boston. <a href=\"http://dx.doi.org/10.17613/605z-nt78\">http://dx.doi.org/10.17613/605z-nt78</a>.",
        "Upham, Finn, and Julie Cumming. 2020. “Auditory Streaming Complexity and Renaissance Mass Ordinary Cycles.” <i>Empirical Musicology Review</i> 15 (3–4):202–22."
    ],
    "2019": [
        "Alfaro-Contreras, María, Jorge Calvo-Zaragoza, and José M. Iñesta. 2019. “Approaching End-to-End Optical Music Recognition for Homophonic Scores.” In <i>Pattern Recognition and Image Analysis</i>, edited by Aythami Morales, Julian Fierrez, José Salvador Sánchez, and Bernardete Ribeiro, 147–58. Lecture Notes in Computer Science. Springer International Publishing.",
        "Baró, Arnau, Pau Riba, Jorge Calvo-Zaragoza, and Alicia Fornés. 2019. “From Optical Music Recognition to Handwritten Music Recognition: A Baseline.” <i>Pattern Recognition Letters</i> 123 (May):1–8. <a href=\"https://doi.org/10.1016/j.patrec.2019.02.029\">https://doi.org/10.1016/j.patrec.2019.02.029</a>.",
        "Calvo-Zaragoza, Jorge, Jose Javier Valero-Mas, and Juan R. Rico-Juan. 2019. “Recognition of Handwritten Music Symbols Using Meta-Features Obtained from Weak Classifiers Based on Nearest Neighbor.” In <i>Proceedings of the 6th International Conference on Pattern Recognition Applications and Methods</i>, 96–104. <a href=\"http://www.scitepress.org/DigitalLibrary/Link.aspx?doi=10.5220/0006120200960104\">http://www.scitepress.org/DigitalLibrary/Link.aspx?doi=10.5220/0006120200960104</a>.",
        "Calvo-Zaragoza, Jorge, and Antonio-Javier Gallego. 2019. “A Selectional Auto-Encoder Approach for Document Image Binarization.” <i>Pattern Recognition</i> 86 (February):37–47. <a href=\"https://doi.org/10.1016/j.patcog.2018.08.011\">https://doi.org/10.1016/j.patcog.2018.08.011</a>.",
        "Cumming, Julie, and Evelyn Tribble. 2019. “Distributed Cognition, Improvisation and the Performing Arts in Early Modern Europe.” In <i>History of Distributed Cognition 2: From Medieval to Renaissance Culture</i>. Vol. 2. Edinburgh, Scotland: University of Edinburgh Press.",
        "Cumming, Julie, and Zoey Cochran. 2019. “The Questione Della Musica: Revisiting the Origins of the Italian Madrigal.” Presented at the Medieval and Renaissance Music Conference, Basel, Switzerland, July 4.",
        "De Luca, Elsa, Inga Behrendt, Ichiro Fujinaga, Kate Helsen, Alessandra Ignesti, Debra Lacoste, and Sarah Ann Long. 2019. “Capturing Early Notations in MEI: The Case of Old Hispanic Neumes.” <i>Musiktheorie-Zeitschrift Für Musikwissenschaft</i> 2:229–49.",
        "De Luca, Elsa. 2019. “Review of: La Transición al Rito Romano En Aragón y Navarra: Fuentes, Escenarios, Tradiciones by Juan Pablo Rubio Sadia, Napoli, Editrice Domenicana Italiana, 2018.” <i>Revista Portuguesa de Musicologia | Portuguese Journal of Musicology</i> 6 (1):237–42.",
        "Dixon, Simon, Polina Proutskova, Tillman Weyde, Daniel Wolff, Martin Pfleiderer, Klaus Frieler, Frank Höger, et al. 2019. “Dig That Lick: Exploring Patterns in Jazz Solos.” In <i>Dmrn+ 14: Digital Music Research Network 2019</i>.",
        "Fujinaga, Ichiro, and Gabriel Vigliensoni. 2019. “The Art of Teaching Computers: The SIMSSA Optical Music Recognition Workflow System.” In <i>Proceedings of the 27th European Signal Processing Conference</i>, 330–34. A Coruña, Spain. <a href=\"https://doi.org/10.23919/EUSIPCO.2019.8902658\">https://doi.org/10.23919/EUSIPCO.2019.8902658</a>.",
        "Fujinaga, Ichiro. 2019. “Single Interface for Music Score Searching and Analysis (SIMSSA) Project: Optical Music Recognition Workflow for Neume Notation.” In <i>Proceedings of the Computers and the Humanities Symposium (JinMonCom)</i>, Vol. 2019 (1):281–86. Osaka, Japan: Information Processing Society of Japan.",
        "Gover, Matan, and Ichiro Fujinaga. 2019. “A Notation-Based Query Language for Searching in Symbolic Music.” In <i>Proceedings of the 6th International Workshop on Digital Libraries for Musicology</i>, 79–83. The Hague, Netherlands: ACM.",
        "Ju, Yaolong, Samuel Howes, Cory McKay, Nathaniel Condit-Schultz, Jorge Calvo-Zaragoza, and Ichiro Fujinaga. 2019. “An Interactive Workflow for Generating Chord Labels for Homorhythmic Music in Symbolic Formats.” In <i>Proceedings of the 20th International Society for Music Information Retrieval Conference</i>, 862–69. Delft, Netherlands.",
        "Mateiu, Tudor N., Antonio-Javier Gallego, and Jorge Calvo-Zaragoza. 2019. “Domain Adaptation for Handwritten Symbol Recognition: A Case of Study in Old Music Manuscripts.” In <i>Pattern Recognition and Image Analysis</i>, edited by Aythami Morales, Julian Fierrez, José Salvador Sánchez, and Bernardete Ribeiro, 135–46. Lecture Notes in Computer Science. Springer International Publishing.",
        "Nuñez-Alcover, Alicia, Pedro J. Ponce de León, and Jorge Calvo-Zaragoza. 2019. “Glyph and Position Classification of Music Symbols in Early Music Manuscripts.” In <i>Pattern Recognition and Image Analysis</i>, edited by Aythami Morales, Julian Fierrez, José Salvador Sánchez, and Bernardete Ribeiro, 159–68. Lecture Notes in Computer Science. Springer International Publishing.",
        "Nápoles López, Néstor, Claire Arthur, and Ichiro Fujinaga. 2019. “Key-Finding Based on a Hidden Markov Model and Key Profiles.” In <i>Proceedings of the 6th International Workshop on Digital Libraries for Musicology</i>, 33–37. DLfM ’19. The Hague, Netherlands: ACM. <a href=\"https://doi.org/10.1145/3358664.3358675\">https://doi.org/10.1145/3358664.3358675</a>.",
        "Pacha, Alexander, Jorge Calvo-Zaragoza, and Jan Hajič Jr. 2019. “Learning Notation Graph Construction for Full-Pipeline Optical Music Recognition.” In <i>Proceedings of the 20th International Society for Music Information Retrieval Conference</i>.",
        "Reuse, Timothy de, and Ichiro Fujinaga. 2019a. “Pattern Clustering in Monophonic Music by Learning a Non-Linear Embedding from Human Annotations.” In <i>Proceedings of the 20th International Society for Music Information Retrieval Conference</i>, 761–68. Delft, Netherlands.",
        "Reuse, Timothy de, and Ichiro Fujinaga. 2019b. “Robust Transcript Alignment on Medieval Chant Manuscripts.” In <i>Proceedings of the 2nd International Workshop on Reading Music Systems</i>. Delft, Netherlands.",
        "Reuse, Timothy de. 2019. “A Machine Learning Approach to Pattern Discovery in Symbolic Music.” Master’s Thesis, Montreal, Canada: McGill University.",
        "Thomae, Martha E., Julie E. Cumming, and Ichiro Fujinaga. 2019. “The Mensural Scoring-Up Tool.” In <i>Proceedings of the 6th International Workshop on Digital Libraries for Musicology</i>, 9–19. The Hague, Netherlands: ACM. <a href=\"https://doi.org/10.1145/3358664.3358668\">https://doi.org/10.1145/3358664.3358668</a>.",
        "Upham, Finn. 2019. “HUMAN SUBTRACTED: SOCIAL DISTORTION OF MUSICTECHNOLOGY.” In <i>Proceedings of the  1 St Workshop on Designing Human-Centric Music  Information Research Systems</i>, 23–25. Delft, Netherlands. <a href=\"https://sites.google.com/view/designinghuman-centricmir/proceedings\">https://sites.google.com/view/designinghuman-centricmir/proceedings</a>."
    ],
    "2018": [
        "Arthur, Claire, Julie Cumming, and Peter Schubert. 2018a. “Aims and Methods for Examining Two-Voice Counterpoint.” In <i>Oxford Handbook of Music and Corpus Studies</i>, edited by Daniel Shanahan, Ashley Burgoyne, and Ian Quinn. Oxford, UK: Oxford University Press.",
        "Arthur, Claire, Julie Cumming, and Peter Schubert. 2018b. “The Role of Structural Tones in Establishing Mode in Renaissance Two-Part Counterpoint.” In <i>Proceedings of the 15th International Conference on Music Perception and Cognition</i>. Montreal, QC.",
        "Baró, Arnau, Pau Riba, Jorge Calvo-Zaragoza, and Alicia Fornés. 2018. “Optical Music Recognition by Long Short-Term Memory Networks.” In <i>GREC 2017: Graphics Recognition. Current Trends and Evolutions</i>, edited by Alicia Fornés and Bart Lamiroy, 81–95. Lecture Notes in Computer Science. Springer International Publishing.",
        "Calvo-Zaragoza, J., A. H. Toselli, and E. Vidal. 2018. “Probabilistic Music-Symbol Spotting in Handwritten Scores.” In <i>2018 16th International Conference on Frontiers in Handwriting Recognition (ICFHR)</i>, 558–63. <a href=\"https://doi.org/10.1109/ICFHR-2018.2018.00103\">https://doi.org/10.1109/ICFHR-2018.2018.00103</a>.",
        "Calvo-Zaragoza, Jorge, Francisco J. Castellanos, Gabriel Vigliensoni, and Ichiro Fujinaga. 2018. “Deep Neural Networks for Document Processing of Music Score Images.” <i>Applied Sciences</i> 8 (5):654. <a href=\"https://doi.org/10.3390/app8050654\">https://doi.org/10.3390/app8050654</a>.",
        "Calvo-Zaragoza, Jorge, Jan Hajič, and Alexander Pacha. 2018. “Discussion Group Summary: Optical Music Recognition.” In <i>GREC 2017: Graphics Recognition. Current Trends and Evolutions</i>, edited by Alicia Fornés and Bart Lamiroy, 152–57. Lecture Notes in Computer Science. Springer International Publishing.",
        "Calvo-Zaragoza, Jorge, and David Rizo. 2018. “Camera-PrIMus: Neural End-to-End Optical Music Recognition on Realistic Monophonic Scores.” In <i>Proceedings of the 19th International Society for Music Information Retrieval Conference</i>, 8. Paris, France.",
        "Castellanos, Francisco J., Jorge Calvo-Zaragoza, Gabriel Vigliensoni, and Ichiro Fujinaga. 2018. “Document Analysis of Music Score Images with Selectional Auto Encoders.” In <i>Proceedings of the 19th International Society for Music Information Retrieval Conference</i>, 256–63. Paris, France. <a href=\"http://cloud.simssa.ca/index.php/s/FjJGQ6josKEIWNn\">http://cloud.simssa.ca/index.php/s/FjJGQ6josKEIWNn</a>.",
        "Condit-Schultz, Nat, Yaolong Ju, and Ichiro Fujinaga. 2018. “A Flexible Approach to Automated Harmonic Analysis: Multiple Annotations of Chorales by Bach and Prætorius.” In <i>Proceedings of the 19th International Society for Music Information Retrieval Conference</i>, 66–73. Paris, France: ISMIR.",
        "Cumming, Julie E., Cory McKay, Jonathan Stuchbery, and Ichiro Fujinaga. 2018. “Methodologies for Creating Symbolic Corpora of Western Music before 1600.” In <i>Proceedings of the 19th International Society for Music Information Retrieval Conference</i>, 491–98. Paris, France: ISMIR.",
        "Cumming, Julie. 2018. “Why Should Musicologists Do Digital Humanities?” <i>Troja: Jahrbuch Für Renaissancemusik, (Re)-Constructing Renaissance Music: Perspectives from the Digital Humanities and Music Theory</i>, 35–46.",
        "Desmond, Karen. 2018. <i>Music and the Moderni, 1300-1500: The Ars Nova in Theory and Practice</i>. Cambridge University Press.",
        "Hajič Jr., Jan, Marta Kolárová, Alexander Pacha, and Jorge Calvo-Zaragoza. 2018. “How Current Optical Music Recognition Systems Are Becoming Useful for Digital Libraries.” In <i>Proceedings of the 5th International Conference on Digital Libraries for Musicology</i>, 57–61. DLfM ’18. New York, USA: ACM. <a href=\"https://doi.org/10.1145/3273024.3273034\">https://doi.org/10.1145/3273024.3273034</a>.",
        "Long, Sarah Ann. 2018. “International Image Interoperability Framework; Gallica; e-Codices: Virtual Manuscript Library of Switzerland.” <i>Journal of the American Musicological Society</i> 71 (2):561–71.",
        "McKay, Cory, Julie Cumming, and Ichiro Fujinaga. 2018. “JSymbolic 2.2: Extracting Features from Symbolic Music for Use in Musicological and MIR Research.” In <i>Proceedings of the 19th International Society for Music Information Retrieval Conference</i>, 348–54. Paris, France: ISMIR.",
        "Nápoles López, Néstor, Gabriel Vigliensoni, and Ichiro Fujinaga. 2018. “Encoding Matters.” In <i>Proceedings of the 5th International Conference on Digital Libraries for Musicology</i>, 69–73. DLfM ’18. Paris, France: Association for Computing Machinery. <a href=\"https://doi.org/10.1145/3273024.3273027\">https://doi.org/10.1145/3273024.3273027</a>.",
        "Pacha, Alexander, and Jorge Calvo-Zaragoza. 2018. “Optical Music Recognition in Mensural Notation with Region-Based Convolutional Neural Networks.” In <i>Proceedings of the 19th International Society for Music Information Retrieval Conference</i>, 240–47. Paris, France.",
        "Rizo, David, Jorge Calvo-Zaragoza, and José M. Iñesta. 2018. “MuRET: A Music Recognition, Encoding, and Transcription Tool.” In <i>Proceedings of the 5th International Conference on Digital Libraries for Musicology</i>, 52–56. DLfM ’18. New York, NY, USA: ACM. <a href=\"https://doi.org/10.1145/3273024.3273029\">https://doi.org/10.1145/3273024.3273029</a>.",
        "Román, Miguel A., Antonio Pertusa, and Jorge Calvo-Zaragoza. 2018. “An End-to-End Framework for Audio-to-Score Music Transcription on Monophonic Excerpts.” In <i>Proceedings of the 19th International Society for Music Information Retrieval Conference</i>. Paris, France.",
        "Shaw, Rebecca. 2018. “Differentiae in the Cantus Manuscript Database.” In <i>Proceedings of the 6th International Conference on Digital Libraries for Musicology (DLfM19)</i>.",
        "Sober-Mira, Javier, Jorge Calvo-Zaragoza, David Rizo, and José M. Iñesta. 2018. “Pen-Based Music Document Transcription with Convolutional Neural Networks.” In <i>2017 14th IAPR International Conference on Document Analysis and Recognition (ICDAR)</i>, edited by Alicia Fornés and Bart Lamiroy, 71–80. Lecture Notes in Computer Science. Springer International Publishing.",
        "Vigliensoni, Gabriel, Jorge Calvo-Zaragoza, and Ichiro Fujinaga. 2018a. “An Environment for Machine Pedagogy: Learning How to Teach Computers to Read Music.” In <i>Joint Proceedings of the ACM Intelligent User Interface Workshops: Intelligent Music Interfaces for Listening and Creation (MILC)</i>. Tokyo, Japan. <a href=\"http://cloud.simssa.ca/index.php/s/bBK9N6gQTpPaKkl\">http://cloud.simssa.ca/index.php/s/bBK9N6gQTpPaKkl</a>.",
        "Vigliensoni, Gabriel, Jorge Calvo-Zaragoza, and Ichiro Fujinaga. 2018b. “Developing an Environment for Teaching Computers to Read Music.” In <i>Proceedings of 1st International Workshop on Reading Music Systems</i>. Paris, France. <a href=\"http://cloud.simssa.ca/index.php/s/ImKlwsuLoI099uI\">http://cloud.simssa.ca/index.php/s/ImKlwsuLoI099uI</a>."
    ],
    "2017": [
        "Barone, Michael D., Kurt Dacosta, Gabriel Vigliensoni, and Matthew H. Woolhouse. 2017. “GRAIL: Database Linking Music Metadata Across Artist, Release,and Track.” In <i>Proceedings of the 4th International Workshop on Digital Libraries for Musicology</i>, 49–54. Association for Computing Machinery. <a href=\"https://dl.acm.org/doi/10.1145/3144749.3144760\">https://dl.acm.org/doi/10.1145/3144749.3144760</a>.",
        "Behrendt, Inga, Jennifer Bain, and Kate Helsen. 2017. “MEI Kodierung Der Frühesten Notation in Linienlosen Neumen.” Edited by Hannah Busch, Franz Fischer, and Patrick Sahle. <i>Kodikologie Und Paläographie Im Digitalen Zeitalter / Codicology and Paleography in the Digital Age</i> 4:281–96.",
        "Calvo-Zaragoza, J., A. H. Toselli, and E. Vidal. 2017. “Handwritten Music Recognition for Mensural Notation: Formulation, Data and Baseline Results.” In <i>2017 14th IAPR International Conference on Document Analysis and Recognition (ICDAR)</i>, 01:1081–86. <a href=\"https://doi.org/10.1109/ICDAR.2017.179\">https://doi.org/10.1109/ICDAR.2017.179</a>.",
        "Calvo-Zaragoza, Jorge, Antonio Pertusa, and Jose Oncina. 2017. “Staff-Line Detection and Removal Using a Convolutional Neural Network.” <i>Machine Vision and Applications</i> 28 (5):665–74. <a href=\"https://doi.org/10.1007/s00138-017-0844-4\">https://doi.org/10.1007/s00138-017-0844-4</a>.",
        "Calvo-Zaragoza, Jorge, Antonio-Javier Gallego, and Antonio Pertusa. 2017. “Recognition of Handwritten Music Symbols with Convolutional Neural Codes.” In <i>2017 14th IAPR International Conference on Document Analysis and Recognition (ICDAR)</i>, 01:691–96. <a href=\"https://doi.org/10.1109/ICDAR.2017.118\">https://doi.org/10.1109/ICDAR.2017.118</a>.",
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017a. “A Machine Learning Framework for the Categorization of Elements in Images of Musical Documents.” In <i>Proceedings of the Third International on Technologies for Music Notation and Representation (TENOR 2017)</i>. La Coruña, Spain. <a href=\"http://cloud.simssa.ca/index.php/s/NExq8IWkue2IjCH\">http://cloud.simssa.ca/index.php/s/NExq8IWkue2IjCH</a>.",
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017b. “One-Step Detection of Background, Staff Lines, and Symbols in Medieval Music Manuscripts with Convolutional Neural Networks.” In <i>Proceedings of the International Society for Music Information Retrieval</i>, 724–30. Suzhou, China. <a href=\"http://cloud.simssa.ca/index.php/s/JuPGmwlvAP9ckkR\">http://cloud.simssa.ca/index.php/s/JuPGmwlvAP9ckkR</a>.",
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017c. “Staff-Line Detection on Grayscale Images with Pixel Classification.” In <i>Pattern Recognition and Image Analysis</i>, edited by Luís A. Alexandre, José Salvador Sánchez, and João M. F. Rodrigues, 279–86. Lecture Notes in Computer Science. Faro, Portugalpixel: Springer International Publishing. <a href=\"http://cloud.simssa.ca/index.php/s/tZswNa5gjwkoatf\">http://cloud.simssa.ca/index.php/s/tZswNa5gjwkoatf</a>.",
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017d. “Pixelwise Binarization of Musical Documents with Convolutional Neural Networks.” In <i>Proceedings of the 15th IAPR International Conference on Machine Vision Applications</i>. Nagoya, Japan.",
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017e. “Pixelwise Classification for Music Document Analysis.” In <i>2017 Seventh International Conference on Image Processing Theory, Tools and Applications (IPTA)</i>, 1–6. Montreal, Canada. <a href=\"https://doi.org/10.1109/IPTA.2017.8310134\">https://doi.org/10.1109/IPTA.2017.8310134</a>.",
        "Calvo-Zaragoza, Jorge, Ké Zhang, Zeyad Saleh, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017. “Music Document Layout Analysis through Machine Learning and Human Feedback.” In <i>2017 14th IAPR International Conference on Document Analysis and Recognition (ICDAR)</i>, 02:23–24. Tokyo, Japan. <a href=\"https://doi.org/10.1109/ICDAR.2017.259\">https://doi.org/10.1109/ICDAR.2017.259</a>.",
        "Calvo-Zaragoza, Jorge, and Jose Oncina. 2017. “Recognition of Pen-Based Music Notation with Finite-State Machines.” <i>Expert Systems with Applications</i> 72 (April):395–406. <a href=\"https://doi.org/10.1016/j.eswa.2016.10.041\">https://doi.org/10.1016/j.eswa.2016.10.041</a>.",
        "Cumming, Julie. 2017a. “Du Fay’s Use of Improvisatory Techniques in Resvellies Vous et Faites Chiere Lye.” Edited by Julie Cumming, Jesse Rodin, and Massimiliano Locanto. <i>Composition and Improvisation in Fifteenth-Century Music, a Special Issue of the RATM (Rivista Di Analisi e Teoria Musicale)</i> 17 (2):3–23.",
        "Cumming, Julie. 2017b. “Sources and Identity: Composers and Singers in Darnton’s Communications Circuit.” In <i>Sources of Identity: Makers, Owners and Users of Music Sources Before 1600</i>. Turnhout, Belgium: Brepols.",
        "Gallego, Antonio-Javier, and Jorge Calvo-Zaragoza. 2017. “Staff-Line Removal with Selectional Auto-Encoders.” <i>Expert Systems with Applications</i> 89 (December):138–48. <a href=\"https://doi.org/10.1016/j.eswa.2017.07.002\">https://doi.org/10.1016/j.eswa.2017.07.002</a>.",
        "Lewis, David, Kevin Page, and Andrew Hankinson. 2017. “Capturing Context and Provenance of Musicology Research.” In <i>Proceedings of the Music Encoding Conference (2015-2017)</i>, 113–18. Tours, France: Music Encoding Initiative.",
        "Nápoles López, Néstor. 2017. “Automatic Harmonic Analysis of Classicalstring Quartets from Symbolic Score.” Master’s Thesis, Barcelona, Spain: Universitat Pompeu Fabra.",
        "Parada-Cabaleiro, Emilia, Anton Batliner, Alice Baird, and Björn W Schuller. 2017. “The SEILS Dataset: Symbolically Encoded Scores in Modern-Early Notation for Computational Musicology.” In <i>Proceedings of the 18th International Society for Music Information Retrieval Conference</i>, 575–81. Suzhou, China: ISMIR.",
        "Saleh, Zeyad, Ké Zhang, Jorge Calvo-Zaragoza, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017. “Pixel.Js: Web-Based Pixel Classification Correction Platform for Ground Truth Creation.” In <i>Proceedings of the Twelfth IAPR International Workshop on Graphics Recognition</i>. Kyoto, Japan: Springer LNCS.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2017. “The Music Listening Histories Dataset.” In <i>Proceedings of the 18th International Society for Music Information Retrieval Conference</i>, 96–102. Suzhou, China. <a href=\"https://doi.org/10.5281/zenodo.1417499\">https://doi.org/10.5281/zenodo.1417499</a>."
    ],
    "2016": [
        "Bell, Eamonn, and Laurent Pugin. 2016. “Approaches to Handwritten Conductor Annotation Extraction in Musical Scores.” In <i>Proceedings of the 3rd International Workshop on Digital Libraries for Musicology</i>, 33–36. DLfM 2016. New York, NY, USA: ACM. <a href=\"https://doi.org/10.1145/2970044.2970053\">https://doi.org/10.1145/2970044.2970053</a>.",
        "Brinkman, Andrew W., Daniel Shanahan, and Craig Stuart Sapp. 2016. “Musical Stylometry, Machine Learning, and Attribution Studies : A Semi-Supervised Approach to the Works of Josquin.” In <i>Proceedings  of  the  14th  International  Conference  on  Music  Perception  and  Cognition</i>, 91–97. San Francisco, CA, United States: ICMPC.",
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2016. “Document Analysis for Music Scores via Machine Learning.” In <i>Proceedings of the 3rd International Workshop on Digital Libraries for Musicology</i>, 37–40. DLfM 2016. New York, NY, USA: ACM. <a href=\"https://doi.org/10.1145/2970044.2970047\">https://doi.org/10.1145/2970044.2970047</a>.",
        "Calvo-Zaragoza, Jorge, Luisa Micó, and Jose Oncina. 2016. “Music Staff Removal with Supervised Pixel Classification.” <i>International Journal on Document Analysis and Recognition (IJDAR)</i> 19 (3):211–19. <a href=\"https://doi.org/10.1007/s10032-016-0266-2\">https://doi.org/10.1007/s10032-016-0266-2</a>.",
        "Lacoste, Debra, and Barbara Swanson. 2016. “Chants That Defy Classification: The Implications of Categorization in the Cantus Database.” In <i>Proceedings of the Music Encoding Conference (2015-2017)</i>, 73–78. Montreal, QC: Music Encoding Initiative.",
        "Pedersoli, Fabrizio, and George Tzanetakis. 2016. “Document Segmentation and Classification into Musical Scores and Text.” <i>International Journal on Document Analysis and Recognition (IJDAR)</i> 19 (4):289–304.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2016. “Automatic Music Recommendation Systems: Do Demographic, Profiling, and Contextual Features Improve Their Performance?” In <i>Proceedings of the 17th International Society for Music Information Retrieval Conference</i>, 94–100. New York City, USA."
    ],
    "2015": [
        "Cumming, Julie, and Peter Schubert. 2015. “The Origins of Pervasive Imitation.” In <i>The Cambridge History of Fifteenth-Century Music</i>, edited by Anna Maria Busse Berger and Jesse Rodin. Cambridge, UK: Cambridge University Press.",
        "Di Bacco, Giuliano, and Perry Roland. 2015. “MEI for Mensural Notation in the Thesaurus Musicarum Latinarum.” In <i>Proceedings of the Music Encoding Conference (2015-2017)</i>, 25–36. Florence, Italy: Music Encoding Initiative.",
        "Horwitz, Andrew, Andrew Hankinson, and Ichiro Fujinaga. 2015. “A Browser-Based MEI Editor.” Poster presented at the Music Encoding Conference, Florence, Italy, May 18.",
        "Schubert, Peter, and Julie Cumming. 2015. “Another Lesson from Lassus: Quantifying Contrapuntal Repetition in the Duos of 1577.” <i>Early Music</i> 43 (4)."
    ],
    "2014": [
        "Bain, Jennifer, Inga Behrendt, and Katherine Helsen. 2014. “Linienlose Neumen, Neumentrennung und Repräsentation von Neumen mit MEI Schema –Herausforderungen in der Arbeit im Optical Neume Recognition Project (ONRP).” In <i>Digitale Rekonstruktionen mittelalterlicher Bibliotheken</i>, edited by Sabine Philippi and Philipp Vanscheidt, 119–32. Trierer Beiträge zu den historischen Kulturwissenschaften 12. Wiesbaden: Ludwig Reichert.",
        "Cumming, Julie. 2014. “The Past Is Not Over: Special Collections in the Digital Age.” In <i>Meetings with Books: Symposium on Special Collections in the 21st Century. With a Tribute to Raymond Klibansky and an Illustrated Survey of McGill Library Special Collections</i>, edited by Jillian Tomm and Richard Virr, 109–14. Montreal: McGill University Library.",
        "Lacoste, Debra, and Jan Koláček. 2014. “CANTUS for Office and Mass: Building an Online Network of Chant Databases.” In <i>Cantus Planus: Study Group of the International Musicological Society -- Papers Read at the 18th Meeting, Venice, Italy, 2014</i>. Venice, Italy.",
        "Pugin, Laurent, and Rodolfo Zitellini. 2014. “Verovio: A Library for Typesetting MEI.” In <i>Proceedings of the Music Encoding Conference (2013-2014)</i>. University of Virginia, Charlottesville, VA: Music Encoding Initiative.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2014. “Identifying Time Zones in a Large Dataset of Music Listening Logs.” In <i>Proceedings of the International Workshop on Social Media Retrieval and Analysis</i>, 27–32. Gold Coast, Australia."
    ],
    "2013": [
        "Gómez-Pérez, Asunción, Daniel Vila-Suero, Elena Montiel-Ponsoda, Jorge Gracia, and Guadalupe Aguado-de-Cea. 2013. “Guidelines for Multilingual Linked Data.” In <i>Proceedings of the 3rd International Conference on Web Intelligence, Mining and Semantics</i>, 1–12.",
        "Lacoste, Debra. 2013. “CANTUS: A Database for Latin Ecclesiastical Chant - Progress Report (2009).” In <i>Papers Read at the 15th Meeting of the IMS Study Group “Cantus Planus”, DobogókÅ/Hungary, 2009. Aug. 23-29</i>, 939–43. Lions Bay, BC, Canada: The Institute of Medieval Music.",
        "Vigliensoni, Gabriel, Gregory Burlet, and Ichiro Fujinaga. 2013. “Optical Measure Recognition in Common Music Notation.” In <i>Proceedings of the International Society for Music Information Retrieval Conference</i>, 125–30. Curitiba, Brazil.",
        "Vigliensoni, Gabriel, John Ashley Burgoyne, and Ichiro Fujinaga. 2013. “Musicbrainz for the World: The Chilean Experience.” In <i>Proceedings of the 14th International Society for Music Information Retrieval Conference</i>, 131–36. Curitiba, Brazil. <a href=\"https://zenodo.org/record/1417951#.X-rvJtgzYdU\">https://zenodo.org/record/1417951#.X-rvJtgzYdU</a>."
    ],
    "2012": [
        "Hankinson, Andrew, John Ashley Burgoyne, Gabriel Vigliensoni, Alastair Porter, Jessica Thompson, Wendy Liu, Remi Chiu, and Ichiro Fujinaga. 2012. “Digital Document Image Retrieval Using Optical Music Recognition.” In <i>Proceedings of the Conference of the International Society for Music Information Retrieval</i>. Porto, Portugal.",
        "Hankinson, Andrew, John Ashley Burgoyne, Gabriel Vigliensoni, and Ichiro Fujinaga. 2012. “Creating a Large-Scale Searchable Digital Collection from Printed Music Materials.” In <i>Proceedings of the World Wide Web Conference</i>, 903–8. Lyon, FR.",
        "Lacoste, Debra, and Jan Koláček. 2012. “Renewal, Revival, Rejuvenation: A New Vision for the Cantus Database.” In <i>Cantus Planus: Study Group of the International Musicological Society - Papers Read at the 16th Meeting, Vienna, Austria, 2011</i>, 202–9. Vienna: Verlag Brüder Hollinek."
    ],
    "2011": [
        "Helsen, Kate, and Debra Lacoste. 2011. “A Report on the Encoding of Melodic Incipits in the Cantus Database with the Music Font ‘'Volpiano.’” <i>Plainsong &amp; Medieval Music</i> 20 (1):51–65.",
        "Lacoste, Debra. 2011. “The Cantus Database: Mining for Medieval Chant Traditions.” In <i>Digital Medievalist</i>. Vol. 7. Barnard College.",
        "Vigliensoni, Gabriel, John Ashley Burgoyne, Andrew Hankinson, and Ichiro Fujinaga. 2011. “Automatic Pitch Detection in Printed Square Notation.” In <i>Proceedings of the International Society for Music Information Retrieval Conference</i>, 423–28. Miami, FL.",
        "Vigliensoni, Gabriel. 2011. “Touchless Gestural Control of Concatenative Sound Synthesis.” Master’s Thesis, Montreal, Canada: McGill University."
    ],
    "2005": [
        "Sapp, Craig Stuart. 2005. “Online Database of Scores in the Humdrum File Format.” In <i>Proceedings of the 6th International Society for Music Information Retrieval Conference</i>, 664–65. London, UK: ISMIR."
    ]
}
