{
    "2021": [
        "McKay, Cory, and María Elena Cuenca. 2021. “Musical Influences on the Masses and Motets of Cristóbal de Morales and Francisco Guerrero: A Statistical Approach.” Presented at the 49th Medieval and Renaissance International Music Conference, Universidade NOVA de Lisboa, Portugal, July. <a href=\"http://jmir.sourceforge.net/publications/mckay21musical.pdf\">http://jmir.sourceforge.net/publications/mckay21musical.pdf</a>.",
        "Rodríguez-García, Esperanza, and Cory McKay. 2021. “Ave Festiva Ferculis: Exploring Attribution by Combining Manual and Computational Analysis.” Presented at the 49th Medieval and Renaissance International Music Conference, Universidade NOVA de Lisboa, Portugal, July.",
        "Thomae, Martha E. 2021a. “Encoding Mensural Notation with MEI.” Invited Lecture presented at the Paleography course, University of Freiburg, Freiburg, Germany, January 25.",
        "Thomae, Martha E. 2021b. “Digital Infrastructures for Mensural Music Using MEI.” Invited Lecture presented at the Kolloquium Musikwissenschaft, Freiburger Forschungs- und Lehrzentrum Musik (FZM), Freiburg, Germany, January 26.",
        "Thomae, Martha E., Julie Cumming, and Ichiro Fujinaga. 2021. “Guatemalan Cathedral Choirbook 1: From Manuscript to Digital Images to Digital Scores.” Presented at the 49th Medieval and Renaissance International Music Conference, Universidade NOVA de Lisboa, Portugal, July."
    ],
    "2020": [
        "Cumming, Julie E. 2020. “Thoughts on Sustainability, 8 Years Later.” Presented at the Round Four Digging into Data Conference, National Science Foundation, Alexandria, VA, January 29. <a href=\"https://diggingintodata.org/awards/news/round-4-conference-2020\">https://diggingintodata.org/awards/news/round-4-conference-2020</a>.",
        "De Luca, Elsa, and Martha E. Thomae. 2020a. “Workshop I: Introduction to MEI.” Invited Lecture. Prague, Czech Republic (online).",
        "De Luca, Elsa, and Martha E. Thomae. 2020b. “Workshop II: Hands-on MEI Encoding.” Invited Lecture presented at the Digital Humanities in Early Music Research I Series – Session II: Early Music Databases and Encoding, Prague, Czech Republic (online), June 30.",
        "McKay, Cory, Rían Adamían, Julie E. Cumming, and Ichiro Fujinaga. 2020. “Exploring Renaissance Music Using N-Gram Aggregates to Summarize Local Musical Content.” Presented at the Medieval and Renaissance Music Conference, Edinburgh, Scotland, July 4.",
        "Regimbal, Juliette, Gabriel Vigliensoni, Caitlin Hutnyk, and Ichiro Fujinaga. 2020. “IIIF-Based Lyric and Neume Editor for Square-Notation Manuscripts.” Presented at the Music Encoding Conference 2020, Tufts University, Boston, May 27. <a href=\"https://hcommons.org/deposits/item/hc:31975\">https://hcommons.org/deposits/item/hc:31975</a>.",
        "Thomae, Martha E. 2020. “MEI for Encoding Mensural Music – A Survey.” Invited Lecture presented at the Digital Humanities in Early Music Research I Series – Session II: Early Music Databases and Encoding, Prague, Czech Republic (online), June 22.",
        "Thomae, Martha E., Antonio Ríos-Vila, Jorge Calvo-Zaragoza, David Rizo, and José M. Iñesta. 2020. “Retrieving Music Semantics from Optical Music Recognition by Machine Translation.” Presented at the Music Encoding Conference, Tufts University, Boston, MA (online), May."
    ],
    "2019": [
        "Calvo-Zaragoza, Jorge. 2019. “Holistic Methods for Optical Music Recognition.” Presented at the Workshop on SIMSSA XVIII at the Music Encoding Conference, University of Vienna, Vienna, Austria, June 2.",
        "Cuenca Rodríguez, María Elena, and Cory McKay. 2019. “Exploring Musical Style in  the Anonymous and Doubtfully Attributed Mass Movements of the Coimbra  Manuscripts: A Statistical Approach.” Presented at the Medieval and Renaissance Music Conference, Basel, Switzerland.",
        "Cumming, Julie, and Zoey Cochran. 2019. “The Questione Della Musica: Revisiting the Origins of the Italian Madrigal.” Presented at the Medieval and Renaissance Music Conference, Basel, Switzerland, July 4.",
        "De Luca, Elsa, Jennifer Bain, Inga Behrendt, Kate Helsen, Alessandra Ignesti, Debra Lacoste, and Sarah Ann Long. 2019. “Cantus Ultimus’ MEI Neume Module and Its Interoperability Across Chant Notation.” Poster (refereed) presented at the Music Encoding Conference, University of Vienna, Vienna, Austria, May 31.",
        "Fujinaga, Ichiro. 2019. “SIMSSA Project &amp; Linked Open Data.” Presented at the Canadian Workshop on Linked Open Data for Cultural Scholarship, Banff, AB, September 13. <a href=\"https://www.birs.ca/events/2019/2-day-workshops/19w2276\">https://www.birs.ca/events/2019/2-day-workshops/19w2276</a>.",
        "Hopkins, Emily, Yaolong Ju, Gustavo Polins Pedro, Cory McKay, Julie Cumming, and Ichiro Fujinaga. 2019. “SIMSSA DB: Symbolic Music Discovery and Search.” Poster (refereed) presented at the Digital Libraries for Musicology, The Hague, Netherlands, November.",
        "Howes, Samuel, and Yaolong Ju. 2019. “Chord Progressions in Lutheran Chorales.” Presented at the Workshop on SIMSSA (Single Interface for Music Score Searching and Analysis) XIX, Montreal, Canada, September 21. <a href=\"https://www.cirmmt.org/activities/workshops/research/workshop_on_SIMSSA_XIX\">https://www.cirmmt.org/activities/workshops/research/workshop_on_SIMSSA_XIX</a>.",
        "Ju, Yaolong, Gustavo Polins Pedro, Cory McKay, Emily Ann Hopkins, and Julie Cumming. 2019. “Enabling Music Search and Analysis: A Database for Symbolic Music Files.” Poster (refereed) presented at the Music Encoding Conference 2019, University of Vienna, Austria, May 30.",
        "Ju, Yaolong, Samuel Howes, Cory McKay, Nathaniel Condit-Schultz, Jorge Calvo-Zaragoza, and Ichiro Fujinaga. 2019. “An Interactive Workflow for Generating Chord Labels for Homorhythmic Music in Symbolic Formats.” Presented at the 20th annual conference of the International Society for Music Information Retrieval (ISMIR), Delft, Netherlands, November 8.",
        "Ju, Yaolong. 2019. “Search and Analysis Tool for Use with the SIMSSA Database.” Presented at the SIMSSA Workshop, Montréal, QC, June 2.",
        "Laplante, Audrey, and Jean-Sebastian Sauvé. 2019. “The Place of Digital Technologies in Musicology from the Perspective of Music Scholars.” Presented at the Workshop on Requirements, Use Cases, and User Studies in Digital Music Libraries and Archives (RUCUS 2019)/ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL), Urbana-Champaign, IL, USA, June 6.",
        "Margot, Sylvain. 2019. “L’influence Des Espaces Géoculturels Sur La Structure et La Syntaxe Cadentielle Du Rondeau Entre 1250 et 1450.” Presented at the 47th Medieval and Renaissance Music Conference, Schola Cantorum Basiliensis, Basel, Switzerland, July.",
        "McKay, Cory, Emily Hopkins, Gustavo Polins Pedro, Yaolong Ju, Andrew Kam, Julie Cumming, and Ichiro Fujinaga. 2019. “A Collaborative Symbolic Music Database for Computational Research on Music.” Presented at the Medieval and Renaissance Music Conference, Basel, Switzerland.",
        "McKay, Cory, Julie Cumming, and Ichiro Fujinaga. 2019. “Lessons Learned in a Large-Scale Project to Digitize and Computationally Analyze Musical Scores.” Presented at the Digital Humanities Conference, Utrecht, NL, July.",
        "Nápoles López, Néstor, Claire Arthur, and Ichiro Fujinaga. 2019. “Key-Finding Based on a Hidden Markov Model and Key Profiles.” Presented at the 6th International Conference on Digital Libraries for Musicology, The Hague, Netherlands, November 9.",
        "Nápoles López, Néstor, Gabriel Vigliensoni, and Ichiro Fujinaga. 2019. “The Effects of Translation between Symbolic Music Formats: A Case Study with Humdrum, Lilypond, MEI, and MusicXML.” Presented at the Music Encoding Conference, University of Vienna, Vienna, Austria.",
        "Nápoles López, Néstor. 2019. “Cantus Ultimus: Status Update.” Presented at the Workshop on SIMSSA XIX, CIRMMT, McGill University, Montreal.",
        "Pugin, Laurent. 2019. “A Verovio JavaScript Application.” Presented at the Workshop on SIMSSA XVIII at the Music Encoding Conference, University of Vienna, Vienna, Austria, June 2.",
        "Regimbal, Juliette, Zoé McLennan, Gabriel Vigliensoni, Andrew Tran, and Ichiro Fujinaga. 2019a. “Neon2: A Verovio-Based Square-Notation Editor.” Poster (refereed) presented at the Music Encoding Conference, University of Vienna, Vienna, Austria, May 31.",
        "Regimbal, Juliette, Zoé McLennan, Gabriel Vigliensoni, Andrew Tran, and Ichiro Fujinaga. 2019b. “Neon.Js After v3: How to Move Forward with OMR Visualization and Correction of Full Manuscripts.” Presented at the Workshop on SIMSSA XVIII at the Music Encoding Conference, University of Vienna, Vienna, Austria, June 2.",
        "Regimbal, Juliette, and Caitlin Hutnyk. 2019. “Neon: Full Manuscripts, Lyrics and Staves.” Presented at the Workshop on SIMSSA XIX, CIRMMT, McGill University, Montreal, September 21.",
        "Reuse, Timothy de, and Ichiro Fujinaga. 2019. “Pattern Clustering in Monophonic Music by Learning a Non-Linear Embedding from Human Annotations.” Presented at the The 20th International Society for Music Information Retrieval Conference, Delft, Netherlands, November.",
        "Savage, Evan. 2019. “Neume Component Pitch and Type Classification.” Presented at the Workshop on SIMSSA XIX, CIRMMT, McGill University, Montreal, September 21.",
        "Shaw, Rebecca. 2019. “The Differentiae Database.” Presented at the Workshop on SIMSSA XIX, CIRMMT, McGill University, Montreal, September 21.",
        "Thomae, Martha E. 2019a. “Preservation of the Colonial Musical Heritage of Guatemala Through Digitization and Music Encoding Technologies.” Invited Talk presented at the Association of Canadian Archivists McGill Student Chapter’s Annual Colloquium, Montreal, QC, March 18.",
        "Thomae, Martha E. 2019b. “Guatemalan Manuscripts: Digitization Issues and Forthcoming Challenges in the Adaptation of the OMR Workflow for Mensural Music.” Presented at the Workshop on SIMSSA XVIII at the Music Encoding Conference, University of Vienna, Vienna, Austria, June 2.",
        "Thomae, Martha E. 2019c. “OMR for Mensural Notation: Looking at a Guatemalan Music Manuscript.” Presented at the Workshop on SIMSSA XIX, CIRMMT, McGill University, Montreal, September 21.",
        "Thomae, Martha E. 2019d. “Digitization and Encoding of the Musical Contents of a Set of Guatemalan Choirbooks.” Invited Lecture presented at the Multimedia Systems (GLIS 633) course, McGill University, Montreal, QC, November 27.",
        "Thomae, Martha E., Julie Cumming, and Ichiro Fujinaga. 2019a. “Application of Music-Encoding Technologies to Guatemalan Choirbooks, Facilitating Preservation and Musicological Studies of the Colonial Repertoire.” Paper presentation presented at the Music Encoding Conference, University of Vienna, Vienna, Austria, May 31.",
        "Thomae, Martha E., Julie Cumming, and Ichiro Fujinaga. 2019b. “Taking Digital Humanities to Guatemala, a Case Study in the Preservation of Colonial Musical Heritage.” Presented at the Digital Humanities Conference, Utrecht, NL, July 10.",
        "Thomae, Martha E., Julie Cumming, and Ichiro Fujinaga. 2019c. “The Mensural Scoring-up Tool.” Presented at the 6th International Conference on Digital Libraries for Musicology, The Hague, NL, November 9.",
        "Upham, Finn. 2019. “Human Subtracted: Social Distortion of Music Technology.” Presented at the 1 st Workshop on Designing Human-Centric Music  Information Research Systems, Delft, Netherlands, November 2.",
        "Vigliensoni, Gabriel, Alex Daigle, Eric Liu, Jorge Calvo-Zaragoza, Juliette Regimbal, Minh Anh Nguyen, Noah Baxter, Zoé McLennan, and Ichiro Fujinaga. 2019a. “From Image to Encoding: Full Optical Music Recognition of Medieval and Renaissance Music.” Presented at the Music Encoding Conference, University of Vienna, Vienna, Austria, May.",
        "Vigliensoni, Gabriel, Alex Daigle, Eric Liu, Jorge Calvo-Zaragoza, Juliette Regimbal, Minh Anh Nguyen, Noah Baxter, Zoé McLennan, and Ichiro Fujinaga. 2019b. “Overcoming the Challenges of Optical Music Recognition of Early Music with Machine Learning.” Presented at the Digital Humanities Conference, Utrecht, NL, July.",
        "Vigliensoni, Gabriel, Alex Daigle, Eric Liu, Jorge Calvo-Zaragoza, Juliette Regimbal, Minh Anh Nguyen, Noah Baxter, and Zoé Mclennan. 2019. “Image to Encoding: Full Optical Music Recognition of Medieval and Renaissance Music.” Poster (refereed) presented at the Music Encoding Conference, University of Vienna, Vienna, Austria, May 31.",
        "Vigliensoni, Gabriel. 2019. “OMR after Document Segmentation: Classifying and Aligning Music Symbols and Lyrics to Generate MEI Neume Files.” Presented at the Workshop on SIMSSA XVIII at the Music Encoding Conference, University of Vienna, Vienna, Austria, June 2."
    ],
    "2018": [
        "Arthur, Claire, Julie Cumming, and Peter Schubert. 2018a. “Computer-Assisted Modal Identification.” Presented at the Medieval and Renaissance Music Conference, Maynooth University, Maynooth, Ireland, July 5.",
        "Arthur, Claire, Julie Cumming, and Peter Schubert. 2018b. “The Role of Structural Tones in Establishing Mode in Renaissance Two-Part Counterpoint.” Poster presented at the 15th International Conference on Music Perception and Cognition, Montreal, QC, July 26.",
        "Calvo-Zaragoza, Jorge, Ké Zhang, Zeyad Saleh, Gabriel Vigliensoni, and Ichiro Fujinaga. 2018. “Human-Aided Automatic Music Document Analysis.” Presented at the Music Encoding Conference, University of Maryland, College Park, MD, May 22.",
        "Cumming, Julie E. 2018. “The Transformative Power of Digital Tools for Music Research.” Keynote presented at the Joint meeting of the New York State-Ontario (NYS/O) and New England (NEMLA) Chapters of the Music Library Association, and the Quebec Chapter of the Canadian Association of Music Libraries, Archives and Documentation Centres (SQACBM), McGill University, Montreal, QC, November 8.",
        "Cumming, Julie E., and Cory McKay. 2018. “Revisiting the Origins of the Italian Madrigal.” Presented at the Medieval and Renaissance Music Conference, Maynooth University, Maynooth, Ireland, July 5.",
        "Cumming, Julie, Peter Schubert, Cory McKay, Nathaniel Condit-Schultz, and Jonathan Stuchbery. 2018a. “Contrapuntal Style: Josquin Desprez vs. Pierre de La Rue.” Presented at the Renaissance Society of America Annual Meeting, New Orleans, Louisiana, March 23.",
        "Cumming, Julie, Peter Schubert, Cory McKay, Nathaniel Condit-Schultz, and Jonathan Stuchbery. 2018b. “Contrapuntal Style: Josquin Desprez vs. Pierre de La Rue.” Presented at the Conference Pierre de la Rue (ca. 1452-1518), Mechelen, Belgium, November.",
        "Cumming, Julie, and Zoey Cochran. 2018a. “The Questione Della Musica: Revisiting the Origins of the Italian Madrigal.” Presented at the Third Annual Conference on the Italian Madrigal, Colgate University, Hamilton, NY, September.",
        "Cumming, Julie, and Zoey Cochran. 2018b. “The Questione Della Musica: Revisiting the Origins of the Italian Madrigal.” Presented at the American Musicological Society, San Antonio, Texas, November.",
        "Garfinkle, David, and Peter Schubert. 2018. “Computer-Assisted Corpus Analysis Finds a Signature Progression in Willaert and Palestrina.” Presented at the Medieval and Renaissance Music Conference, Maynooth University, Maynooth, Ireland, July 5.",
        "Helsen, Kate, Inga Behrendt, Elsa De Luca, Ichiro Fujinaga, Alessandra Ignesti, Debra Lacoste, and Sarah Long. 2018. “‘A Neume by Any Other Name...’: Considering Neumes Described in MEI.” Panel presented at the IMS Study Group Meeting for Cantus Planus, Linnaeus University, Växjö, Sweden, August 7.",
        "Helsen, Kate, and Mark Daley. 2018. “Melody Models: Construction and Evolution in Office Chants.” Presented at the IMS Study Group Meeting for Cantus Planus, Linnaeus University, Växjö, Sweden, August 7.",
        "Howes, Samuel. 2018. “Harmonic Syntax in the Instrumental Music of Frescobaldi: A Probabilistic Model.” Presented at the Medieval and Renaissance Music Conference, Maynooth University, Maynooth, Ireland, July 5.",
        "Ju, Yaolong, and Katharine Eve Helsen. 2018. “The LMLO Goes MEI: An Exercise in Melodic Encoding Translation.” Presented at the Music Encoding Conference, University of Maryland, College Park, MD, May 22.",
        "Laplante, Audrey, and Jean-Sebastian Sauvé. 2018. “Musicologie Numérique : Développement d’outils et de Services Centrés Sur l’utilisateur.” Presented at the Joint meeting of the New York State-Ontario (NYS/O) and New England (NEMLA) Chapters of the Music Library Association, and the Quebec Chapter of the Canadian Association of Music Libraries, Archives and Documentation Centres (SQACBM), Montreal, QC, November 8.",
        "Laplante, Audrey. 2018. “Musicologie Numérique : Développement d’outils et de Services Centrés Sur l’utilisateur.” Presented at the Joint meeting of the New York State-Ontario (NYS/O) and New England (NEMLA) Chapters of the Music Library Association, and the Quebec Chapter of the Canadian Association of Music Libraries, Archives and Documentation Centres (SQACBM), McGill University, Montreal, QC, November 8.",
        "Lorenz, Ian. 2018. “Cadéac, Gombert, and CRIM: A New Approach to the Renaissance Imitation Mass.” Presented at the Medieval and Renaissance Music Conference, Maynooth University, Maynooth, Ireland, July 5.",
        "McKay, Cory. 2018. “Performing Statistical Musicological Research Using JSymbolic and Machine Learning.” Presented at the International Conference on the Anatomy of Polyphonic Music around 1500, Cascais, Portugal, June.",
        "McLennan, Zoé, and Juliette Regimbal. 2018. “Neon2: Redesigning a Web-Based MEI Neume Editor.” Presented at the SIMSSA XVII Workshop, Montréal, QC, December 1.",
        "Nguyen, Minh Anh. 2018. “Updates to RODAN Gamera Interactive Classifier.” Presented at the Workshop on SIMSSA XVII: Infrastructure for Music Discovery, McGill University, December 1.",
        "Nápoles López, Néstor, Gabriel Vigliensoni, and Ichiro Fujinaga. 2018. “Encoding Matters.” Presented at the 5th International Conference on Digital Libraries for Musicology, Paris, France, September.",
        "Nápoles, Néstor, Claire Arthur, and Ichiro Fujinaga. 2018. “Symbolic and Audio Key Detection Based on a Hidden Markov Model.” Poster presented at the 19th International Society for Music Information Retrieval Conference, Paris, France, September 23.",
        "Polins Pedro, Gustavo, and Yaolong Ju. 2018. “SIMSSA DB Implementation.” Presented at the Workshop on SIMSSA XVII: Infrastructure for Music Discovery, McGill University, December 1.",
        "Rizo, David, Jorge Calvo-Zaragoza, and José M. Iñesta. 2018. “MuRET: A Music Recognition, Encoding, and Transcription Tool.” Presented at the 5th International Conference on Digital Libraries for Musicology, Institut de Recherche et Coordination Acoustique/Musique (IRCAM), Paris, France, September 28.",
        "Sailor, Malcolm. 2018. “The Insufficiently Stimulated Ear: A Corpus Study of Dissonance Treatment from Dufay to Victoria.” Presented at the 45th Medieval and Renaissance Music Conference, Prague, Czech Republic, July 4.",
        "Thomae, Martha E. 2018a. “Automatic Scoring up of Mensural Parts.” Presented at the Workshop on Digital Musicology, McGill University, Montreal, QC, April 27.",
        "Thomae, Martha E. 2018b. “Guatemalan Manuscript Digitization Project.” Presented at the Workshop on SIMSSA XVII: Infrastructure for Music Discovery, McGill University, Montreal, QC, December 1.",
        "Thomae, Martha E., Julie Cumming, and Ichiro Fujinaga. 2018a. “Automatic Scoring up of Music in Mensural Notation.” Presented at the Music Encoding Conference, University of Maryland, College Park, MD, May 23.",
        "Thomae, Martha E., Julie Cumming, and Ichiro Fujinaga. 2018b. “Automatic Scoring up of Parts in Mensural Notation.” Presented at the Medieval and Renaissance Music Conference, Maynooth University, Maynooth, Ireland, July 6.",
        "Vigliensoni, Gabriel, Jorge Calvo-Zaragoza, and Ichiro Fujinaga. 2018. “Developing an Environment for Teaching Computers to Read Music.” Presented at the 1st International Workshop on Reading Music Systems (WoRMS), Conservatoire national des arts et métiers, Paris, France, September 20.",
        "Vigliensoni, Gabriel. 2018. “Pixel.Js: A Web-Based Application for Pixel Classification and Correction.” Presented at the Workshop on SIMSSA XVII: Infrastructure for Music Discovery, McGill University, December 1."
    ],
    "2017": [
        "Behrendt, Inga. 2017. “Report on MEI Meeting in Graz.” Presented at the Workshop on SIMSSA XIII, Art Gallery of Nova Scotia, Halifax, NS, September 22.",
        "Calvo-Zaragoza, Jorge, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017. “A Unified Approach towards Automatic Recognition of Heterogeneous Music Documents.” Presented at the Music Encoding Conference, Tours, France, May 17.",
        "Calvo-Zaragoza, Jorge, Ké Zhang, Zeyad Saleh, Gabriel Vigliensoni, and Ichiro Fujinaga. 2017. “Music Document Layout Analysis through Machine Learning and Human Feedback.” Presented at the International Workshop on Graphic Recognition, Kyoto, Japan, November 10.",
        "Garfinkle, David. 2017. “PatternFinder: Content-Based Music Retrieval with Music21.” Presented at the DLfM ’17 4th International Workshop on Digital Libraries for Musicology, Shanghai, China, October 28.",
        "Ju, Yaolong, Nathaniel Condit-Schultz, Claire Arthur, and Ichiro Fujinaga. 2017. “Non-Chord Tone Identification Using Deep Neural Networks.” Presented at the 18th International Society for Music Information Retrieval Conference (Late-Breaking), Suzhou, China.",
        "Ju, Yaolong. 2017. “Non-Chord Tone Identification.” Presented at the Workshop on SIMSSA XII, McGill University, Montreal, QC, August 7.",
        "Lacoste, Debra (Session organizer). 2017. “Virginity in Song: Digital Tools for the Liturgy.” Presented at the Renaissance Society of America, Chicago, IL, March 30.",
        "Lacoste, Debra, and Kate Helsen. 2017. “Cantus Hackathon: Create an Inventory with the Cantus Database in Real Time.” Presented at the International Congress on Medieval Studies, Kalamazoo, MI, May 11.",
        "Lacoste, Debra. 2017. “Mysterious Melodies? Searching for Chant Melodies in the Cantus Database.” Presented at the “New Technologies and Renaissance Studies II: Emerging, Continuing Directions” session at the meeting of the Renaissance Society of America, Chicago, IL, April 1.",
        "Sapp, Craig. 2017. “Verovio Humdrum Viewer: Online Music Notation Rendering and Analysis.” Keynote presented at the Workshop on SIMSSA XII, McGill University, Montreal, QC, August 7.",
        "Thomae, Martha. 2017. “A Methodology for Encoding Mensural Music: Introducing the Mensural MEI Translator.” Invited Talk, Music Technology Group, Universitat Pompeu Fabra, Barcelona, Spain, May 22.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2017. “The Music Listening Histories Dataset.” Presented at the 18th International Society for Music Information Retrieval Conference, Suzhou, China, October 23. <a href=\"http://cloud.simssa.ca/index.php/s/HUvFrpFl0ErRVz9\">http://cloud.simssa.ca/index.php/s/HUvFrpFl0ErRVz9</a>."
    ],
    "2016": [
        "Bain, Jennifer. 2016. “Cantus Ultimus Project.” Presented at the Workshop on SIMSSA XI, AMS/SMT, Vancouver, BC, November 3.",
        "Cumming, Julie. 2016. “SIMSSA, Search and Analysis Axis, Fall 2016.” Presented at the Workshop on SIMSSA XI, AMS/SMT, Vancouver, BC, November 3.",
        "De Luca, Elsa. 2016. “Encoding Old Hispanic Neumes.” Presented at the Music Encoding Conference, McGill University, Montreal, QC, May 18.",
        "Desmond, Karen, and Peter Schubert. 2016. “2000 Years of Seeing Sounds: The Story of Music Notation.” Lecture Recital presented at the Music Encoding Conference, McGill University, Montreal, QC, May 20. <a href=\"https://www.youtube.com/watch?v=2GqtCqnC8SI\">https://www.youtube.com/watch?v=2GqtCqnC8SI</a>.",
        "Desmond, Karen. 2016a. “Circles, Dots, and Lines: Punctuating Sound in Time, ca. 1300-1350.” Invited Talk, Stanford University, February.",
        "Desmond, Karen. 2016b. “Rhythmic Organization and the Potential for Flexibility in Digital Encodings of Machaut’s Music.” Presented at the 51st International Congress on Medieval Studies, Western Michigan University, Kalamazoo, MI, May.",
        "Lacoste, Debra, Jennifer Bain, and Kate Helsen. 2016. “Working ‘Live’ with Cantus Ultimus.” Presented at the IMS Study Group Meeting for Cantus Planus, Dublin, Ireland, August.",
        "Laplante, Audrey, and Ariane Legault-Venne. 2016. “Searching for Music Materials in Libraries: Discovery Tools as Seen through the Eyes of the Users.” Presented at the 65th Congress of the International Association of Music Libraries, Archives and Documentation Centres, Rome, Italy, July 7.",
        "Laplante, Audrey. 2016. “Digitizing Music Scores and Manuscripts in Libraries: Issues and Challenges.” Presented at the 65th Congress of the International Association of Music Libraries, Archives and Documentation Centres, Rome, Italy, July 8.",
        "Thomae, Martha E. 2016. “Digital Encoding of Mensural Music.” Presented at the Workshop on SIMSSA X, McGill University, Montreal, QC, September 24.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2016. “Automatic Music Recommendation Systems: Do Demographic, Profiling, and Contextual Features Improve Their Performance?” Poster presented at the 17th International Society for Music Information Retrieval Conference, New York, August 7."
    ],
    "2015": [
        "Bain, Jennifer, and Inga Behrendt. 2015. “The Optical Neume Recognition Project (ONRP) — the Development of a Search Tool for Neume Notation in Digital Images.” Poster presented at the 2nd International Workshop on Opportunities for the Automatic Pattern Recognition and Analysis of Historical Documents, “Machines and Manuscripts 2015,” Karlsruher Institut für Technologie, Institute for Data Processing and Electronics, Karlsruhe, Germany, February 19.",
        "Cumming, Julie. 2015a. “How Has Technology Changed Musicological Research?” Paper presented at the IMS Study Group on Digital Musicology, International Association of Music Libraries, Archives and Documentation Centres/International Musicological Society Congress “Music Research in the Digital Age,” New York, June 21.",
        "Cumming, Julie. 2015b. “SIMSSA, Search and Analysis Axis, Report on Our First Year.” Paper presented at the International Association of Music Libraries, Archives and Documentation Centres/International Musicological Society Congress “Music Research in the Digital Age,” SIMSSA Worksop VI, New York, June 27.",
        "Cumming, Julie. 2015c. “Analysing Renaissance Polyphony: Taxonomy and Terminology, 1 and 2.” Paper presented at the Annual Medieval and Renaissance Music Conference, Brussels, Belgium, July 9.",
        "Cumming, Julie. 2015d. “SIMSSA, Search and Analysis Axis, Report on Our First Year.” Paper presented at the Annual Medieval and Renaissance Music Conference, SIMSSA Workshop VII, Brussels, Belgium, July 9.",
        "Cumming, Julie. 2015e. “‘Google Scores’ without Google.” Invited Talk presented at the Digital Humanities Group, University of Florida, Gainesville, November 16.",
        "Fogarty, Andrew, Andrew Hankinson, and Ichiro Fujinaga. 2015. “A Browser-Based Neume Metadata Editor.” Poster presented at the Music Encoding Conference, Florence, Italy, May 18.",
        "Helsen, Kate, Inga Behrendt, Jennifer Bain, and Anton Stingl. 2015. “The Optical Neume Recognition Project.” Paper presented at the Annual Medieval and Renaissance Music Conference, Brussels, Belgium, July 7.",
        "Helsen, Kate, Inga Behrendt, and Jennifer Bain. 2015. “Neume Search.” Paper presented at the Annual Medieval and Renaissance Music Conference, Brussels, Belgium, July 8.",
        "Kepper, Johannes, and Richard Sänger. 2015. “Scholarly Editions 2.0: How Digital Media Promote New Editorial Concepts.” Paper presented at the International Association of Music Libraries, Archives and Documentation Centres/International Musicological Society Congress “Music Research in the Digital Age,” New York, June 21.",
        "Lacoste, Debra, Kate Helsen, and a panel of experts. 2015. “CANTUS Antique Fragments Roadshow, or, ‘What’s My Fragment?’” Workshop and panel discussion presented at the International Congress on Medieval Studies, Kalamazoo, MI, May 14.",
        "Laplante, Audrey, and Ariane Legault-Venne. 2015. “La Recherche de Documents Musicaux Dans Les Outils de Découverte.” Presented at the 2015 Annual Meeting of the Québec Chapter of CAML, Grande bibliothèque, BAnQ, Montréal, QC, November 27.",
        "Laplante, Audrey. 2015. “Vers Une Bibliothèque Numérique Collective de Partitions Musicales.” Presented at the Journée d’étude sur les bibliothèques numériques, Université de Montréal, Montréal, QC, February 26.",
        "Roland, Perry. 2015. “MEI at 15: Reflections, Challenges, and Opportunities.” Paper presented at the International Association of Music Libraries, Archives and Documentation Centres/International Musicological Society Congress “Music Research in the Digital Age,” New York, June 21.",
        "Rusch, René, and Ryan Bannon. 2015. “Music Analysis as a Workflow? An Automated Approach to Studying Voice Leading in the Bach Chorales.” Presented at the Workshop on digital musicology: Revisiting the collaborative process between music researchers and computer programmers, CIRMMT, McGill University, Montreal, March 20.",
        "Swanson, Barbara. 2015. “Working with Technologies in Development: Mediating Sources, Research Needs, and Technological Capacity in Cantus Ultimus.” Presented at the Digital Humanities Forum, Dalhousie University, Halifax, NS, October 22."
    ],
    "2014": [
        "Bain, Jennifer. 2014. “Medieval Musicology in a Digital World: The Optical Neume Recognition Project.” Paper presented at the SSHRC-sponsored Connecting Cultures: Imagining Canada’s Future, Dalhousie University, Halifax, NS, March.",
        "Behrendt, Inga. 2014. “The Optical Neume Recognition Project.” Poster presented at the Mitgliedertreffen der deutschsprachigen Sektion der Internationalen Gesellschaft für Studien des Gregorianischen Chorals (AISCGre), Tettenweis, Germany, October.",
        "Helsen, Kate. 2014a. “The Optical Neume Recognition Project.” Poster presented at the Big Data Days @ Western Conference, University of Western Ontario, London, ON, March.",
        "Helsen, Kate. 2014b. “A New Way to See Neumes: The Optical Neume Recognition Project in Action.” Paper presented at the Meeting of IMS Study Group Cantus Planus, Venice, Italy, July.",
        "Helsen, Kate. 2014c. “The Optical Neume Recognition Project.” Poster presented at the Don Wright Faculty of Music Research Showcase, University of Western Ontario, London, ON, September.",
        "Helsen, Kate. 2014d. “Optical Neume Recognition Project.” TED-Style Talk, Medieval Day at Western, London, ON, November.",
        "Lacoste, Debra, and Alison Altstatt. 2014. “An EnCHANTed Evening: Singing Vespers with CANTUS (A Workshop).” Paper presented at the International Congress on Medieval Studies, Kalamazoo, MI, May 8.",
        "Lacoste, Debra, and a panel of experts. 2014. “So You Think You Can Chant: Gregorian or Old-Roman?” Demonstration and panel discussion presented at the International Congress on Medieval Studies, Kalamazoo, MI, May 10.",
        "Lacoste, Debra. 2014. “Old, New, and Newer Chant Databases: The CANTUS Database and CANTUS Index.” Paper presented at the Annual Meeting of the Canadian Society of Medievalists (part of the 2014 Congress of the Humanities and Social Sciences), St. Catharines, ON, May 24.",
        "Rodin, Jesse, and Craig Sapp. 2014. “Beyond the Thematic Index: Repertory-Wide Search and Analysis.” Poster presented at the Empirical Approaches to Music Theory and Musicology session at the AMS/SMT Annual Meeting, Milwaukee, WI, November.",
        "Rusch, René. 2014. “Figured-Bass Patterns and Their Voice-Leading Tendencies in Bach’s Four-Part Chorales.” Presented at the An afternoon of seminars, CIRMMT, McGill University, Montreal, January 21.",
        "Schubert, Peter, and Julie Cumming. 2014. “Another Lesson from Lassus.” Paper presented at the Annual Joint meeting of the AMS/SMT, Milwaukee, WI, November 9.",
        "Sexton, Alan. 2014. “The Optical Neume Recognition Project.” Paper presented at the The Institute for Computing and Information Sciences (iCIS), Radboud University, Nijmegen, Netherlands, April.",
        "Swanson, Barbara. 2014. “Optical Neume Recognition: Teaching Computers to Think Like Medieval Singers.” Paper presented at the Dalhousie Postdoctoral Research Day, Dalhousie University, Halifax, NS, October.",
        "Vigliensoni, Gabriel, and Ichiro Fujinaga. 2014. “Identifying Time Zones in a Large Dataset of Music Listening Logs.” Poster presented at the 1st International Workshop on Social Media Retrieval and Analysis, Gold Coast, Australia, July 11."
    ],
    "2013": [
        "Behrendt, Inga. 2013. “Neumen und Neumentrennung – Herausforderungen in der Arbeit im Optical Neume Recognition Project (ONRP).” Paper presented at the Digitale Rekonstruktionen mittelalterlicher Bibliotheken Universität, Trier, Germany, January.",
        "Koláček, Jan. 2013. “CANTUS Index: Building an Online Network of Chant Databases for Mass and Office.” Poster presented at the Medieval and Renaissance International Music Conference, Certaldo, Italy, July.",
        "Vigliensoni, Gabriel, Gregory Burlet, and Ichiro Fujinaga. 2013. “Optical Measure Recognition in Common Music Notation.” Poster presented at the 14th International Society for Music Information Retrieval Conference, Curitiba, Brazil, November 4.",
        "Vigliensoni, Gabriel, John Ashley Burgoyne, and Ichiro Fujinaga. 2013. “Musicbrainz for the World: The Chilean Experience.” Poster presented at the 14th International Society for Music Information Retrieval Conference, Curitiba, Brazil, November 4. <a href=\"https://zenodo.org/record/1417951#.X-rvJtgzYdU\">https://zenodo.org/record/1417951#.X-rvJtgzYdU</a>."
    ],
    "2012": [
        "Behrendt, Inga. 2012. “The Optical Neume Recognition Project.” Poster presented at the Digital Humanities Workshop, Katholieke Universiteit Leuven, Belgium, September.",
        "Lacoste, Debra. 2012. “Tracking the Chants of the Laurier Manuscript in the Cantus Database.” Presented at the Meeting of the Canadian Society of Medievalists, Waterloo, ON, May 27."
    ],
    "2011": [
        "Behrendt, Inga. 2011a. “Die älteste Notenschrift trifft auf modernste Technik: Vorstellung des „Automatic Neume Recognition Program” zur computergestützten Analyse der St. Galler Neumenotation.” Paper presented at the Music Room at the Abby of St. Gall, St. Gall, Switzerland, May.",
        "Behrendt, Inga. 2011b. “Automatic Neume Recognition Program — Computergestützte Analyse der St. Galler Neumenotation.” Paper presented at the Internationaler Sommerkurs Gregorianik 2011, Folkwang Universität der Künste, Essen, Germany, July.",
        "Helsen, Kate. 2011a. “The Optical Neume Recognition Project.” Poster presented at the Digital Medievalist Poster Session at the 46th International Congress on Medieval Studies, Western Michigan University, Kalamazoo, MI, May.",
        "Helsen, Kate. 2011b. “Venite et Videte: The Optical Neume Recognition Project.” Paper presented at the 46th International Congress on Medieval Studies, Western Michigan University, Kalamazoo, MI, May.",
        "Helsen, Kate. 2011c. “The Optical Neume Recognition Project: First Steps.” Paper presented at the Cantus Planus Conference, Vienna, August.",
        "Koláček, Jan, and Debra Lacoste. 2011. “A New Research Interface for the Cantus Database.” Presented at the International Congress on Medieval Studies, Kalamazoo, MI, May 12.",
        "Lacoste, Debra. 2011a. “The Reinvention of the Cantus Database: New Location, Platform and Features for Old Chants.” Presented at the Sixth Annual Colloquium of the Gregorian Institute of Cnada, Halifax, NS, Canada, August 6.",
        "Lacoste, Debra. 2011b. “Elastic Melodies: Variants in Responsory Verses.” Presented at the IMS Study Group Meeting for Cantus Planus, Vienna, August 26.",
        "Lacoste, Debra. 2011c. “Tracking Hymns Through the Cantus Database.” Presented at the Medieval Day, Wilfrid Laurier University, October 26.",
        "Vigliensoni, Gabriel, John Ashley Burgoyne, Andrew Hankinson, and Ichiro Fujinaga. 2011. “Automatic Pitch Recognition in Printed Sqaure-Note Notation.” Poster presented at the 12th International Society for Music Information Retrieval Conference, Miami, USA, October 24."
    ]
}